const NAME_INDEX = {
	"Bulbasaur": {
		"jp": "フシギダネ"
	},
	"Ivysaur": {
		"jp": "フシギソウ"
	},
	"Venusaur": {
		"jp": "フシギバナ"
	},
	"Charmander": {
		"jp": "ヒトカゲ"
	},
	"Charmeleon": {
		"jp": "リザード"
	},
	"Charizard": {
		"jp": "リザードン"
	},
	"Squirtle": {
		"jp": "ゼニガメ"
	},
	"Wartortle": {
		"jp": "カメール"
	},
	"Blastoise": {
		"jp": "カメックス"
	},
	"Caterpie": {
		"jp": "キャタピー"
	},
	"Metapod": {
		"jp": "トランセル"
	},
	"Butterfree": {
		"jp": "バタフリー"
	},
	"Weedle": {
		"jp": "ビードル"
	},
	"Kakuna": {
		"jp": "コクーン"
	},
	"Beedrill": {
		"jp": "スピアー"
	},
	"Pidgey": {
		"jp": "ポッポ"
	},
	"Pidgeotto": {
		"jp": "ピジョン"
	},
	"Pidgeot": {
		"jp": "ピジョット"
	},
	"Rattata": {
		"jp": "コラッタ"
	},
	"Raticate": {
		"jp": "ラッタ"
	},
	"Spearow": {
		"jp": "オニスズメ"
	},
	"Fearow": {
		"jp": "オニドリル"
	},
	"Ekans": {
		"jp": "アーボ"
	},
	"Arbok": {
		"jp": "アーボック"
	},
	"Pichu": {
		"jp": "ピチュー"
	},
	"Pikachu": {
		"jp": "ピカチュウ"
	},
	"Raichu": {
		"jp": "ライチュウ"
	},
	"Sandshrew": {
		"jp": "サンド"
	},
	"Sandslash": {
		"jp": "サンドパン"
	},
	"Nidoran♀": {
		"jp": "ニドラン♀"
	},
	"Nidorina": {
		"jp": "ニドリーナ"
	},
	"Nidoqueen": {
		"jp": "ニドクイン"
	},
	"Nidoran♂": {
		"jp": "ニドラン♂"
	},
	"Nidorino": {
		"jp": "ニドリーノ"
	},
	"Nidoking": {
		"jp": "ニドキング"
	},
	"Cleffa": {
		"jp": "ピィ"
	},
	"Clefairy": {
		"jp": "ピッピ"
	},
	"Clefable": {
		"jp": "ピクシー"
	},
	"Vulpix": {
		"jp": "ロコン"
	},
	"Ninetales": {
		"jp": "キュウコン"
	},
	"Igglybuff": {
		"jp": "ププリン"
	},
	"Jigglypuff": {
		"jp": "プリン"
	},
	"Wigglytuff": {
		"jp": "プクリン"
	},
	"Zubat": {
		"jp": "ズバット"
	},
	"Golbat": {
		"jp": "ゴルバット"
	},
	"Crobat": {
		"jp": "クロバット"
	},
	"Oddish": {
		"jp": "ナゾノクサ"
	},
	"Gloom": {
		"jp": "クサイハナ"
	},
	"Vileplume": {
		"jp": "ラフレシア"
	},
	"Bellossom": {
		"jp": "キレイハナ"
	},
	"Paras": {
		"jp": "パラス"
	},
	"Parasect": {
		"jp": "パラセクト"
	},
	"Venonat": {
		"jp": "コンパン"
	},
	"Venomoth": {
		"jp": "モルフォン"
	},
	"Diglett": {
		"jp": "ディグダ"
	},
	"Dugtrio": {
		"jp": "ダグトリオ"
	},
	"Meowth": {
		"jp": "ニャース"
	},
	"Persian": {
		"jp": "ペルシアン"
	},
	"Psyduck": {
		"jp": "コダック"
	},
	"Golduck": {
		"jp": "ゴルダック"
	},
	"Mankey": {
		"jp": "マンキー"
	},
	"Primeape": {
		"jp": "オコリザル"
	},
	"Growlithe": {
		"jp": "ガーディ"
	},
	"Arcanine": {
		"jp": "ウインディ"
	},
	"Poliwag": {
		"jp": "ニョロモ"
	},
	"Poliwhirl": {
		"jp": "ニョロゾ"
	},
	"Poliwrath": {
		"jp": "ニョロボン"
	},
	"Politoed": {
		"jp": "ニョロトノ"
	},
	"Abra": {
		"jp": "ケーシィ"
	},
	"Kadabra": {
		"jp": "ユンゲラー"
	},
	"Alakazam": {
		"jp": "フーディン"
	},
	"Machop": {
		"jp": "ワンリキー"
	},
	"Machoke": {
		"jp": "ゴーリキー"
	},
	"Machamp": {
		"jp": "カイリキー"
	},
	"Bellsprout": {
		"jp": "マダツボミ"
	},
	"Weepinbell": {
		"jp": "ウツドン"
	},
	"Victreebel": {
		"jp": "ウツボット"
	},
	"Tentacool": {
		"jp": "メノクラゲ"
	},
	"Tentacruel": {
		"jp": "ドククラゲ"
	},
	"Geodude": {
		"jp": "イシツブテ"
	},
	"Graveler": {
		"jp": "ゴローン"
	},
	"Golem": {
		"jp": "ゴローニャ"
	},
	"Ponyta": {
		"jp": "ポニータ"
	},
	"Rapidash": {
		"jp": "ギャロップ"
	},
	"Slowpoke": {
		"jp": "ヤドン"
	},
	"Slowbro": {
		"jp": "ヤドラン"
	},
	"Slowking": {
		"jp": "ヤドキング"
	},
	"Magnemite": {
		"jp": "コイル"
	},
	"Magneton": {
		"jp": "レアコイル"
	},
	"Farfetch'd": {
		"jp": "カモネギ"
	},
	"Doduo": {
		"jp": "ドードー"
	},
	"Dodrio": {
		"jp": "ドードリオ"
	},
	"Seel": {
		"jp": "パウワウ"
	},
	"Dewgong": {
		"jp": "ジュゴン"
	},
	"Grimer": {
		"jp": "ベトベター"
	},
	"Muk": {
		"jp": "ベトベトン"
	},
	"Shellder": {
		"jp": "シェルダー"
	},
	"Cloyster": {
		"jp": "パルシェン"
	},
	"Gastly": {
		"jp": "ゴース"
	},
	"Haunter": {
		"jp": "ゴースト"
	},
	"Gengar": {
		"jp": "ゲンガー"
	},
	"Onix": {
		"jp": "イワーク"
	},
	"Steelix": {
		"jp": "ハガネール"
	},
	"Drowzee": {
		"jp": "スリープ"
	},
	"Hypno": {
		"jp": "スリーパー"
	},
	"Krabby": {
		"jp": "クラブ"
	},
	"Kingler": {
		"jp": "キングラー"
	},
	"Voltorb": {
		"jp": "ビリリダマ"
	},
	"Electrode": {
		"jp": "マルマイン"
	},
	"Exeggcute": {
		"jp": "タマタマ"
	},
	"Exeggutor": {
		"jp": "ナッシー"
	},
	"Cubone": {
		"jp": "カラカラ"
	},
	"Marowak": {
		"jp": "ガラガラ"
	},
	"Tyrogue": {
		"jp": "バルキー"
	},
	"Hitmonlee": {
		"jp": "サワムラー"
	},
	"Hitmonchan": {
		"jp": "エビワラー"
	},
	"Hitmontop": {
		"jp": "カポエラー"
	},
	"Lickitung": {
		"jp": "ベロリンガ"
	},
	"Koffing": {
		"jp": "ドガース"
	},
	"Weezing": {
		"jp": "マタドガス"
	},
	"Rhyhorn": {
		"jp": "サイホーン"
	},
	"Rhydon": {
		"jp": "サイドン"
	},
	"Chansey": {
		"jp": "ラッキー"
	},
	"Blissey": {
		"jp": "ハピナス"
	},
	"Tangela": {
		"jp": "モンジャラ"
	},
	"Kangaskhan": {
		"jp": "ガルーラ"
	},
	"Horsea": {
		"jp": "タッツー"
	},
	"Seadra": {
		"jp": "シードラ"
	},
	"Kingdra": {
		"jp": "キングドラ"
	},
	"Goldeen": {
		"jp": "トサキント"
	},
	"Seaking": {
		"jp": "アズマオウ"
	},
	"Staryu": {
		"jp": "ヒトデマン"
	},
	"Starmie": {
		"jp": "スターミー"
	},
	"Mr. Mime": {
		"jp": "バリヤード"
	},
	"Scyther": {
		"jp": "ストライク"
	},
	"Scizor": {
		"jp": "ハッサム"
	},
	"Smoochum": {
		"jp": "ムチュール"
	},
	"Jynx": {
		"jp": "ルージュラ"
	},
	"Elekid": {
		"jp": "エレキッド"
	},
	"Electabuzz": {
		"jp": "エレブー"
	},
	"Magby": {
		"jp": "ブビィ"
	},
	"Magmar": {
		"jp": "ブーバー"
	},
	"Pinsir": {
		"jp": "カイロス"
	},
	"Tauros": {
		"jp": "ケンタロス"
	},
	"Magikarp": {
		"jp": "コイキング"
	},
	"Gyarados": {
		"jp": "ギャラドス"
	},
	"Lapras": {
		"jp": "ラプラス"
	},
	"Ditto": {
		"jp": "メタモン"
	},
	"Eevee": {
		"jp": "イーブイ"
	},
	"Vaporeon": {
		"jp": "シャワーズ"
	},
	"Jolteon": {
		"jp": "サンダース"
	},
	"Flareon": {
		"jp": "ブースター"
	},
	"Espeon": {
		"jp": "エーフィ"
	},
	"Umbreon": {
		"jp": "ブラッキー"
	},
	"Porygon": {
		"jp": "ポリゴン"
	},
	"Porygon2": {
		"jp": "ポリゴン２"
	},
	"Omanyte": {
		"jp": "オムナイト"
	},
	"Omastar": {
		"jp": "オムスター"
	},
	"Kabuto": {
		"jp": "カブト"
	},
	"Kabutops": {
		"jp": "カブトプス"
	},
	"Aerodactyl": {
		"jp": "プテラ"
	},
	"Snorlax": {
		"jp": "カビゴン"
	},
	"Articuno": {
		"jp": "フリーザー"
	},
	"Zapdos": {
		"jp": "サンダー"
	},
	"Moltres": {
		"jp": "ファイヤー"
	},
	"Dratini": {
		"jp": "ミニリュウ"
	},
	"Dragonair": {
		"jp": "ハクリュー"
	},
	"Dragonite": {
		"jp": "カイリュー"
	},
	"Mewtwo": {
		"jp": "ミュウツー"
	},
	"Mew": {
		"jp": "ミュウ"
	},
	"Chikorita": {
		"jp": "チコリータ"
	},
	"Bayleef": {
		"jp": "ベイリーフ"
	},
	"Meganium": {
		"jp": "メガニウム"
	},
	"Cyndaquil": {
		"jp": "ヒノアラシ"
	},
	"Quilava": {
		"jp": "マグマラシ"
	},
	"Typhlosion": {
		"jp": "バクフーン"
	},
	"Totodile": {
		"jp": "ワニノコ"
	},
	"Croconaw": {
		"jp": "アリゲイツ"
	},
	"Feraligatr": {
		"jp": "オーダイル"
	},
	"Sentret": {
		"jp": "オタチ"
	},
	"Furret": {
		"jp": "オオタチ"
	},
	"Hoothoot": {
		"jp": "ホーホー"
	},
	"Noctowl": {
		"jp": "ヨルノズク"
	},
	"Ledyba": {
		"jp": "レディバ"
	},
	"Ledian": {
		"jp": "レディアン"
	},
	"Spinarak": {
		"jp": "イトマル"
	},
	"Ariados": {
		"jp": "アリアドス"
	},
	"Chinchou": {
		"jp": "チョンチー"
	},
	"Lanturn": {
		"jp": "ランターン"
	},
	"Togepi": {
		"jp": "トゲピー"
	},
	"Togetic": {
		"jp": "トゲチック"
	},
	"Natu": {
		"jp": "ネイティ"
	},
	"Xatu": {
		"jp": "ネイティオ"
	},
	"Mareep": {
		"jp": "メリープ"
	},
	"Flaaffy": {
		"jp": "モココ"
	},
	"Ampharos": {
		"jp": "デンリュウ"
	},
	"Marill": {
		"jp": "マリル"
	},
	"Azumarill": {
		"jp": "マリルリ"
	},
	"Sudowoodo": {
		"jp": "ウソッキー"
	},
	"Hoppip": {
		"jp": "ハネッコ"
	},
	"Skiploom": {
		"jp": "ポポッコ"
	},
	"Jumpluff": {
		"jp": "ワタッコ"
	},
	"Aipom": {
		"jp": "エイパム"
	},
	"Sunkern": {
		"jp": "ヒマナッツ"
	},
	"Sunflora": {
		"jp": "キマワリ"
	},
	"Yanma": {
		"jp": "ヤンヤンマ"
	},
	"Wooper": {
		"jp": "ウパー"
	},
	"Quagsire": {
		"jp": "ヌオー"
	},
	"Murkrow": {
		"jp": "ヤミカラス"
	},
	"Misdreavus": {
		"jp": "ムウマ"
	},
	"Unown": {
		"jp": "アンノーン"
	},
	"Wobbuffet": {
		"jp": "ソーナンス"
	},
	"Girafarig": {
		"jp": "キリンリキ"
	},
	"Pineco": {
		"jp": "クヌギダマ"
	},
	"Forretress": {
		"jp": "フォレトス"
	},
	"Dunsparce": {
		"jp": "ノコッチ"
	},
	"Gligar": {
		"jp": "グライガー"
	},
	"Snubbull": {
		"jp": "ブルー"
	},
	"Granbull": {
		"jp": "グランブル"
	},
	"Qwilfish": {
		"jp": "ハリーセン"
	},
	"Shuckle": {
		"jp": "ツボツボ"
	},
	"Heracross": {
		"jp": "ヘラクロス"
	},
	"Sneasel": {
		"jp": "ニューラ"
	},
	"Teddiursa": {
		"jp": "ヒメグマ"
	},
	"Ursaring": {
		"jp": "リングマ"
	},
	"Slugma": {
		"jp": "マグマッグ"
	},
	"Magcargo": {
		"jp": "マグカルゴ"
	},
	"Swinub": {
		"jp": "ウリムー"
	},
	"Piloswine": {
		"jp": "イノムー"
	},
	"Corsola": {
		"jp": "サニーゴ"
	},
	"Remoraid": {
		"jp": "テッポウオ"
	},
	"Octillery": {
		"jp": "オクタン"
	},
	"Delibird": {
		"jp": "デリバード"
	},
	"Mantine": {
		"jp": "マンタイン"
	},
	"Skarmory": {
		"jp": "エアームド"
	},
	"Houndour": {
		"jp": "デルビル"
	},
	"Houndoom": {
		"jp": "ヘルガー"
	},
	"Phanpy": {
		"jp": "ゴマゾウ"
	},
	"Donphan": {
		"jp": "ドンファン"
	},
	"Stantler": {
		"jp": "オドシシ"
	},
	"Smeargle": {
		"jp": "ドーブル"
	},
	"Miltank": {
		"jp": "ミルタンク"
	},
	"Raikou": {
		"jp": "ライコウ"
	},
	"Entei": {
		"jp": "エンテイ"
	},
	"Suicune": {
		"jp": "スイクン"
	},
	"Larvitar": {
		"jp": "ヨーギラス"
	},
	"Pupitar": {
		"jp": "サナギラス"
	},
	"Tyranitar": {
		"jp": "バンギラス"
	},
	"Lugia": {
		"jp": "ルギア"
	},
	"Ho-Oh": {
		"jp": "ホウオウ"
	},
	"Celebi": {
		"jp": "セレビィ"
	},
	"Struggle": {
		"jp": "わるあがき"
	},
	"Fury Cutter": {
		"jp": "れんぞくぎり"
	},
	"Bug Bite": {
		"jp": "むしくい"
	},
	"Bite": {
		"jp": "かみつく"
	},
	"Sucker Punch": {
		"jp": "ふいうち"
	},
	"Dragon Breath": {
		"jp": "りゅうのいぶき"
	},
	"Thunder Shock": {
		"jp": "でんきショック"
	},
	"Spark": {
		"jp": "スパーク"
	},
	"Low Kick": {
		"jp": "けたぐり"
	},
	"Karate Chop": {
		"jp": "からてチョップ"
	},
	"Ember": {
		"jp": "ひのこ"
	},
	"Wing Attack": {
		"jp": "つばさでうつ"
	},
	"Peck": {
		"jp": "つつく"
	},
	"Lick": {
		"jp": "したでなめる"
	},
	"Shadow Claw": {
		"jp": "シャドークロー"
	},
	"Vine Whip": {
		"jp": "つるのムチ"
	},
	"Razor Leaf": {
		"jp": "はっぱカッター"
	},
	"Mud Shot": {
		"jp": "マッドショット"
	},
	"Ice Shard": {
		"jp": "こおりのつぶて"
	},
	"Frost Breath": {
		"jp": "こおりのいぶき"
	},
	"Quick Attack": {
		"jp": "でんこうせっか"
	},
	"Scratch": {
		"jp": "ひっかく"
	},
	"Tackle": {
		"jp": "たいあたり"
	},
	"Pound": {
		"jp": "はたく"
	},
	"Cut": {
		"jp": "いあいぎり"
	},
	"Poison Jab": {
		"jp": "どくづき"
	},
	"Acid": {
		"jp": "ようかいえき"
	},
	"Psycho Cut": {
		"jp": "サイコカッター"
	},
	"Rock Throw": {
		"jp": "いわおとし"
	},
	"Metal Claw": {
		"jp": "メタルクロー"
	},
	"Bullet Punch": {
		"jp": "バレットパンチ"
	},
	"Water Gun": {
		"jp": "みずでっぽう"
	},
	"Splash": {
		"jp": "はねる"
	},
	"Mud Slap": {
		"jp": "どろかけ"
	},
	"Zen Headbutt": {
		"jp": "しねんのずつき"
	},
	"Confusion": {
		"jp": "ねんりき"
	},
	"Poison Sting": {
		"jp": "どくばり"
	},
	"Bubble": {
		"jp": "あわ"
	},
	"Feint Attack": {
		"jp": "だましうち"
	},
	"Steel Wing": {
		"jp": "はがねのつばさ"
	},
	"Fire Fang": {
		"jp": "ほのおのキバ"
	},
	"Rock Smash": {
		"jp": "いわくだき"
	},
	"Transform": {
		"jp": "へんしん"
	},
	"Counter": {
		"jp": "カウンター"
	},
	"Powder Snow": {
		"jp": "こなゆき"
	},
	"Charge Beam": {
		"jp": "チャージビーム"
	},
	"Volt Switch": {
		"jp": "ボルトチェンジ"
	},
	"Dragon Tail": {
		"jp": "ドラゴンテール"
	},
	"Air Slash": {
		"jp": "エアスラッシュ"
	},
	"Infestation": {
		"jp": "まとわりつく"
	},
	"Struggle Bug": {
		"jp": "むしのていこう"
	},
	"Astonish": {
		"jp": "おどろかす"
	},
	"Hex": {
		"jp": "たたりめ"
	},
	"Iron Tail": {
		"jp": "アイアンテール"
	},
	"Fire Spin": {
		"jp": "ほのおのうず"
	},
	"Bullet Seed": {
		"jp": "タネマシンガン"
	},
	"Extrasensory": {
		"jp": "じんつうりき"
	},
	"Snarl": {
		"jp": "バークアウト"
	},
	"Hidden Power": {
		"jp": "めざめるパワー"
	},
	"Wrap": {
		"jp": "まきつく"
	},
	"Hyper Beam": {
		"jp": "はかいこうせん"
	},
	"Dark Pulse": {
		"jp": "あくのはどう"
	},
	"Sludge": {
		"jp": "ヘドロこうげき"
	},
	"Vice Grip": {
		"jp": "はさむ"
	},
	"Flame Wheel": {
		"jp": "かえんぐるま"
	},
	"Megahorn": {
		"jp": "メガホーン"
	},
	"Flamethrower": {
		"jp": "かえんほうしゃ"
	},
	"Dig": {
		"jp": "あなをほる"
	},
	"Cross Chop": {
		"jp": "クロスチョップ"
	},
	"Psybeam": {
		"jp": "サイケこうせん"
	},
	"Earthquake": {
		"jp": "じしん"
	},
	"Stone Edge": {
		"jp": "ストーンエッジ"
	},
	"Ice Punch": {
		"jp": "れいとうパンチ"
	},
	"Discharge": {
		"jp": "ほうでん"
	},
	"Flash Cannon": {
		"jp": "ラスターカノン"
	},
	"Drill Peck": {
		"jp": "ドリルくちばし"
	},
	"Ice Beam": {
		"jp": "れいとうビーム"
	},
	"Blizzard": {
		"jp": "ふぶき"
	},
	"Heat Wave": {
		"jp": "ねっぷう"
	},
	"Aerial Ace": {
		"jp": "つばめがえし"
	},
	"Drill Run": {
		"jp": "ドリルライナー"
	},
	"Petal Blizzard": {
		"jp": "はなふぶき"
	},
	"Bug Buzz": {
		"jp": "むしのさざめき"
	},
	"Poison Fang": {
		"jp": "どくどくのキバ"
	},
	"Night Slash": {
		"jp": "つじぎり"
	},
	"Bubble Beam": {
		"jp": "バブルこうせん"
	},
	"Submission": {
		"jp": "じごくぐるま"
	},
	"Low Sweep": {
		"jp": "ローキック"
	},
	"Aqua Jet": {
		"jp": "アクアジェット"
	},
	"Aqua Tail": {
		"jp": "アクアテール"
	},
	"Seed Bomb": {
		"jp": "タネばくだん"
	},
	"Psyshock": {
		"jp": "サイコショック"
	},
	"Ancient Power": {
		"jp": "げんしのちから"
	},
	"Rock Tomb": {
		"jp": "がんせきふうじ"
	},
	"Rock Slide": {
		"jp": "いわなだれ"
	},
	"Power Gem": {
		"jp": "パワージェム"
	},
	"Ominous Wind": {
		"jp": "あやしいかぜ"
	},
	"Shadow Ball": {
		"jp": "シャドーボール"
	},
	"Magnet Bomb": {
		"jp": "マグネットボム"
	},
	"Iron Head": {
		"jp": "アイアンヘッド"
	},
	"Thunder Punch": {
		"jp": "かみなりパンチ"
	},
	"Thunder": {
		"jp": "かみなり"
	},
	"Thunderbolt": {
		"jp": "１０まんボルト"
	},
	"Twister": {
		"jp": "たつまき"
	},
	"Dragon Pulse": {
		"jp": "りゅうのはどう"
	},
	"Dragon Claw": {
		"jp": "ドラゴンクロー"
	},
	"Disarming Voice": {
		"jp": "チャームボイス"
	},
	"Draining Kiss": {
		"jp": "ドレインキッス"
	},
	"Dazzling Gleam": {
		"jp": "マジカルシャイン"
	},
	"Moonblast": {
		"jp": "ムーンフォース"
	},
	"Play Rough": {
		"jp": "じゃれつく"
	},
	"Cross Poison": {
		"jp": "クロスポイズン"
	},
	"Sludge Bomb": {
		"jp": "ヘドロばくだん"
	},
	"Sludge Wave": {
		"jp": "ヘドロウェーブ"
	},
	"Gunk Shot": {
		"jp": "ダストシュート"
	},
	"Bone Club": {
		"jp": "ホネこんぼう"
	},
	"Bulldoze": {
		"jp": "じならし"
	},
	"Mud Bomb": {
		"jp": "どろばくだん"
	},
	"Signal Beam": {
		"jp": "シグナルビーム"
	},
	"X-Scissor": {
		"jp": "シザークロス"
	},
	"Flame Charge": {
		"jp": "ニトロチャージ"
	},
	"Flame Burst": {
		"jp": "はじけるほのお"
	},
	"Fire Blast": {
		"jp": "だいもんじ"
	},
	"Brine": {
		"jp": "しおみず"
	},
	"Water Pulse": {
		"jp": "みずのはどう"
	},
	"Scald": {
		"jp": "ねっとう"
	},
	"Hydro Pump": {
		"jp": "ハイドロポンプ"
	},
	"Psychic": {
		"jp": "サイコキネシス"
	},
	"Icy Wind": {
		"jp": "こごえるかぜ"
	},
	"Fire Punch": {
		"jp": "ほのおのパンチ"
	},
	"Solar Beam": {
		"jp": "ソーラービーム"
	},
	"Leaf Blade": {
		"jp": "リーフブレード"
	},
	"Power Whip": {
		"jp": "パワーウィップ"
	},
	"Air Cutter": {
		"jp": "エアカッター"
	},
	"Hurricane": {
		"jp": "ぼうふう"
	},
	"Brick Break": {
		"jp": "かわらわり"
	},
	"Swift": {
		"jp": "スピードスター"
	},
	"Horn Attack": {
		"jp": "つのでつく"
	},
	"Stomp": {
		"jp": "ふみつけ"
	},
	"Hyper Fang": {
		"jp": "ひっさつまえば"
	},
	"Body Slam": {
		"jp": "のしかかり"
	},
	"Close Combat": {
		"jp": "インファイト"
	},
	"Dynamic Punch": {
		"jp": "ばくれつパンチ"
	},
	"Focus Blast": {
		"jp": "きあいだま"
	},
	"Aurora Beam": {
		"jp": "オーロラビーム"
	},
	"Wild Charge": {
		"jp": "ワイルドボルト"
	},
	"Zap Cannon": {
		"jp": "でんじほう"
	},
	"Avalanche": {
		"jp": "ゆきなだれ"
	},
	"Brave Bird": {
		"jp": "ブレイブバード"
	},
	"Sky Attack": {
		"jp": "ゴッドバード"
	},
	"Sand Tomb": {
		"jp": "すなじごく"
	},
	"Rock Blast": {
		"jp": "ロックブラスト"
	},
	"Silver Wind": {
		"jp": "ぎんいろのかぜ"
	},
	"Night Shade": {
		"jp": "ナイトヘッド"
	},
	"Gyro Ball": {
		"jp": "ジャイロボール"
	},
	"Heavy Slam": {
		"jp": "ヘビーボンバー"
	},
	"Overheat": {
		"jp": "オーバーヒート"
	},
	"Grass Knot": {
		"jp": "くさむすび"
	},
	"Energy Ball": {
		"jp": "エナジーボール"
	},
	"Future Sight": {
		"jp": "みらいよち"
	},
	"Mirror Coat": {
		"jp": "ミラーコート"
	},
	"Outrage": {
		"jp": "げきりん"
	},
	"Crunch": {
		"jp": "かみくだく"
	},
	"Foul Play": {
		"jp": "イカサマ"
	},
	"フシギダネ": {},
	"フシギソウ": {},
	"フシギバナ": {},
	"ヒトカゲ": {},
	"リザード": {},
	"リザードン": {},
	"ゼニガメ": {},
	"カメール": {},
	"カメックス": {},
	"キャタピー": {},
	"トランセル": {},
	"バタフリー": {},
	"ビードル": {},
	"コクーン": {},
	"スピアー": {},
	"ポッポ": {},
	"ピジョン": {},
	"ピジョット": {},
	"コラッタ": {},
	"ラッタ": {},
	"オニスズメ": {},
	"オニドリル": {},
	"アーボ": {},
	"アーボック": {},
	"ピチュー": {},
	"ピカチュウ": {},
	"ライチュウ": {},
	"サンド": {},
	"サンドパン": {},
	"ニドラン♀": {},
	"ニドリーナ": {},
	"ニドクイン": {},
	"ニドラン♂": {},
	"ニドリーノ": {},
	"ニドキング": {},
	"ピィ": {},
	"ピッピ": {},
	"ピクシー": {},
	"ロコン": {},
	"キュウコン": {},
	"ププリン": {},
	"プリン": {},
	"プクリン": {},
	"ズバット": {},
	"ゴルバット": {},
	"クロバット": {},
	"ナゾノクサ": {},
	"クサイハナ": {},
	"ラフレシア": {},
	"キレイハナ": {},
	"パラス": {},
	"パラセクト": {},
	"コンパン": {},
	"モルフォン": {},
	"ディグダ": {},
	"ダグトリオ": {},
	"ニャース": {},
	"ペルシアン": {},
	"コダック": {},
	"ゴルダック": {},
	"マンキー": {},
	"オコリザル": {},
	"ガーディ": {},
	"ウインディ": {},
	"ニョロモ": {},
	"ニョロゾ": {},
	"ニョロボン": {},
	"ニョロトノ": {},
	"ケーシィ": {},
	"ユンゲラー": {},
	"フーディン": {},
	"ワンリキー": {},
	"ゴーリキー": {},
	"カイリキー": {},
	"マダツボミ": {},
	"ウツドン": {},
	"ウツボット": {},
	"メノクラゲ": {},
	"ドククラゲ": {},
	"イシツブテ": {},
	"ゴローン": {},
	"ゴローニャ": {},
	"ポニータ": {},
	"ギャロップ": {},
	"ヤドン": {},
	"ヤドラン": {},
	"ヤドキング": {},
	"コイル": {},
	"レアコイル": {},
	"カモネギ": {},
	"ドードー": {},
	"ドードリオ": {},
	"パウワウ": {},
	"ジュゴン": {},
	"ベトベター": {},
	"ベトベトン": {},
	"シェルダー": {},
	"パルシェン": {},
	"ゴース": {},
	"ゴースト": {},
	"ゲンガー": {},
	"イワーク": {},
	"ハガネール": {},
	"スリープ": {},
	"スリーパー": {},
	"クラブ": {},
	"キングラー": {},
	"ビリリダマ": {},
	"マルマイン": {},
	"タマタマ": {},
	"ナッシー": {},
	"カラカラ": {},
	"ガラガラ": {},
	"バルキー": {},
	"サワムラー": {},
	"エビワラー": {},
	"カポエラー": {},
	"ベロリンガ": {},
	"ドガース": {},
	"マタドガス": {},
	"サイホーン": {},
	"サイドン": {},
	"ラッキー": {},
	"ハピナス": {},
	"モンジャラ": {},
	"ガルーラ": {},
	"タッツー": {},
	"シードラ": {},
	"キングドラ": {},
	"トサキント": {},
	"アズマオウ": {},
	"ヒトデマン": {},
	"スターミー": {},
	"バリヤード": {},
	"ストライク": {},
	"ハッサム": {},
	"ムチュール": {},
	"ルージュラ": {},
	"エレキッド": {},
	"エレブー": {},
	"ブビィ": {},
	"ブーバー": {},
	"カイロス": {},
	"ケンタロス": {},
	"コイキング": {},
	"ギャラドス": {},
	"ラプラス": {},
	"メタモン": {},
	"イーブイ": {},
	"シャワーズ": {},
	"サンダース": {},
	"ブースター": {},
	"エーフィ": {},
	"ブラッキー": {},
	"ポリゴン": {},
	"ポリゴン２": {},
	"オムナイト": {},
	"オムスター": {},
	"カブト": {},
	"カブトプス": {},
	"プテラ": {},
	"カビゴン": {},
	"フリーザー": {},
	"サンダー": {},
	"ファイヤー": {},
	"ミニリュウ": {},
	"ハクリュー": {},
	"カイリュー": {},
	"ミュウツー": {},
	"ミュウ": {},
	"チコリータ": {},
	"ベイリーフ": {},
	"メガニウム": {},
	"ヒノアラシ": {},
	"マグマラシ": {},
	"バクフーン": {},
	"ワニノコ": {},
	"アリゲイツ": {},
	"オーダイル": {},
	"オタチ": {},
	"オオタチ": {},
	"ホーホー": {},
	"ヨルノズク": {},
	"レディバ": {},
	"レディアン": {},
	"イトマル": {},
	"アリアドス": {},
	"チョンチー": {},
	"ランターン": {},
	"トゲピー": {},
	"トゲチック": {},
	"ネイティ": {},
	"ネイティオ": {},
	"メリープ": {},
	"モココ": {},
	"デンリュウ": {},
	"マリル": {},
	"マリルリ": {},
	"ウソッキー": {},
	"ハネッコ": {},
	"ポポッコ": {},
	"ワタッコ": {},
	"エイパム": {},
	"ヒマナッツ": {},
	"キマワリ": {},
	"ヤンヤンマ": {},
	"ウパー": {},
	"ヌオー": {},
	"ヤミカラス": {},
	"ムウマ": {},
	"アンノーン": {},
	"ソーナンス": {},
	"キリンリキ": {},
	"クヌギダマ": {},
	"フォレトス": {},
	"ノコッチ": {},
	"グライガー": {},
	"ブルー": {},
	"グランブル": {},
	"ハリーセン": {},
	"ツボツボ": {},
	"ヘラクロス": {},
	"ニューラ": {},
	"ヒメグマ": {},
	"リングマ": {},
	"マグマッグ": {},
	"マグカルゴ": {},
	"ウリムー": {},
	"イノムー": {},
	"サニーゴ": {},
	"テッポウオ": {},
	"オクタン": {},
	"デリバード": {},
	"マンタイン": {},
	"エアームド": {},
	"デルビル": {},
	"ヘルガー": {},
	"ゴマゾウ": {},
	"ドンファン": {},
	"オドシシ": {},
	"ドーブル": {},
	"ミルタンク": {},
	"ライコウ": {},
	"エンテイ": {},
	"スイクン": {},
	"ヨーギラス": {},
	"サナギラス": {},
	"バンギラス": {},
	"ルギア": {},
	"ホウオウ": {},
	"セレビィ": {},
	"わるあがき": {},
	"れんぞくぎり": {},
	"むしくい": {},
	"かみつく": {},
	"ふいうち": {},
	"りゅうのいぶき": {},
	"でんきショック": {},
	"スパーク": {},
	"けたぐり": {},
	"からてチョップ": {},
	"ひのこ": {},
	"つばさでうつ": {},
	"つつく": {},
	"したでなめる": {},
	"シャドークロー": {},
	"つるのムチ": {},
	"はっぱカッター": {},
	"マッドショット": {},
	"こおりのつぶて": {},
	"こおりのいぶき": {},
	"でんこうせっか": {},
	"ひっかく": {},
	"たいあたり": {},
	"はたく": {},
	"いあいぎり": {},
	"どくづき": {},
	"ようかいえき": {},
	"サイコカッター": {},
	"いわおとし": {},
	"メタルクロー": {},
	"バレットパンチ": {},
	"みずでっぽう": {},
	"はねる": {},
	"どろかけ": {},
	"しねんのずつき": {},
	"ねんりき": {},
	"どくばり": {},
	"あわ": {},
	"だましうち": {},
	"はがねのつばさ": {},
	"ほのおのキバ": {},
	"いわくだき": {},
	"へんしん": {},
	"カウンター": {},
	"こなゆき": {},
	"チャージビーム": {},
	"ボルトチェンジ": {},
	"ドラゴンテール": {},
	"エアスラッシュ": {},
	"まとわりつく": {},
	"むしのていこう": {},
	"おどろかす": {},
	"たたりめ": {},
	"アイアンテール": {},
	"ほのおのうず": {},
	"タネマシンガン": {},
	"じんつうりき": {},
	"バークアウト": {},
	"めざめるパワー": {},
	"まきつく": {},
	"はかいこうせん": {},
	"あくのはどう": {},
	"ヘドロこうげき": {},
	"はさむ": {},
	"かえんぐるま": {},
	"メガホーン": {},
	"かえんほうしゃ": {},
	"あなをほる": {},
	"クロスチョップ": {},
	"サイケこうせん": {},
	"じしん": {},
	"ストーンエッジ": {},
	"れいとうパンチ": {},
	"ほうでん": {},
	"ラスターカノン": {},
	"ドリルくちばし": {},
	"れいとうビーム": {},
	"ふぶき": {},
	"ねっぷう": {},
	"つばめがえし": {},
	"ドリルライナー": {},
	"はなふぶき": {},
	"むしのさざめき": {},
	"どくどくのキバ": {},
	"つじぎり": {},
	"バブルこうせん": {},
	"じごくぐるま": {},
	"ローキック": {},
	"アクアジェット": {},
	"アクアテール": {},
	"タネばくだん": {},
	"サイコショック": {},
	"げんしのちから": {},
	"がんせきふうじ": {},
	"いわなだれ": {},
	"パワージェム": {},
	"あやしいかぜ": {},
	"シャドーボール": {},
	"マグネットボム": {},
	"アイアンヘッド": {},
	"かみなりパンチ": {},
	"かみなり": {},
	"１０まんボルト": {},
	"たつまき": {},
	"りゅうのはどう": {},
	"ドラゴンクロー": {},
	"チャームボイス": {},
	"ドレインキッス": {},
	"マジカルシャイン": {},
	"ムーンフォース": {},
	"じゃれつく": {},
	"クロスポイズン": {},
	"ヘドロばくだん": {},
	"ヘドロウェーブ": {},
	"ダストシュート": {},
	"ホネこんぼう": {},
	"じならし": {},
	"どろばくだん": {},
	"シグナルビーム": {},
	"シザークロス": {},
	"ニトロチャージ": {},
	"はじけるほのお": {},
	"だいもんじ": {},
	"しおみず": {},
	"みずのはどう": {},
	"ねっとう": {},
	"ハイドロポンプ": {},
	"サイコキネシス": {},
	"こごえるかぜ": {},
	"ほのおのパンチ": {},
	"ソーラービーム": {},
	"リーフブレード": {},
	"パワーウィップ": {},
	"エアカッター": {},
	"ぼうふう": {},
	"かわらわり": {},
	"スピードスター": {},
	"つのでつく": {},
	"ふみつけ": {},
	"ひっさつまえば": {},
	"のしかかり": {},
	"インファイト": {},
	"ばくれつパンチ": {},
	"きあいだま": {},
	"オーロラビーム": {},
	"ワイルドボルト": {},
	"でんじほう": {},
	"ゆきなだれ": {},
	"ブレイブバード": {},
	"ゴッドバード": {},
	"すなじごく": {},
	"ロックブラスト": {},
	"ぎんいろのかぜ": {},
	"ナイトヘッド": {},
	"ジャイロボール": {},
	"ヘビーボンバー": {},
	"オーバーヒート": {},
	"くさむすび": {},
	"エナジーボール": {},
	"みらいよち": {},
	"ミラーコート": {},
	"げきりん": {},
	"かみくだく": {},
	"イカサマ": {}
}"
var name_maps = {};
var gap = name_list.length/2;
for(var i = 0 ; i <= name_list.length-1 ; i++){
	var name_map = {};
	name_map["jp"] = name_list[i+gap];
	name_maps[name_list[i]] = name_map;
}
Objectjp: undefined__proto__: Object__defineGetter__: __defineGetter__()__defineSetter__: __defineSetter__()__lookupGetter__: __lookupGetter__()__lookupSetter__: __lookupSetter__()constructor: Object()hasOwnProperty: hasOwnProperty()isPrototypeOf: isPrototypeOf()propertyIsEnumerable: propertyIsEnumerable()toLocaleString: toLocaleString()toString: toString()valueOf: valueOf()get __proto__: __proto__()set __proto__: __proto__()
JSON.stringify(name_maps,null,'\t')
"{
	"Bulbasaur": {
		"jp": "フシギダネ"
	},
	"Ivysaur": {
		"jp": "フシギソウ"
	},
	"Venusaur": {
		"jp": "フシギバナ"
	},
	"Charmander": {
		"jp": "ヒトカゲ"
	},
	"Charmeleon": {
		"jp": "リザード"
	},
	"Charizard": {
		"jp": "リザードン"
	},
	"Squirtle": {
		"jp": "ゼニガメ"
	},
	"Wartortle": {
		"jp": "カメール"
	},
	"Blastoise": {
		"jp": "カメックス"
	},
	"Caterpie": {
		"jp": "キャタピー"
	},
	"Metapod": {
		"jp": "トランセル"
	},
	"Butterfree": {
		"jp": "バタフリー"
	},
	"Weedle": {
		"jp": "ビードル"
	},
	"Kakuna": {
		"jp": "コクーン"
	},
	"Beedrill": {
		"jp": "スピアー"
	},
	"Pidgey": {
		"jp": "ポッポ"
	},
	"Pidgeotto": {
		"jp": "ピジョン"
	},
	"Pidgeot": {
		"jp": "ピジョット"
	},
	"Rattata": {
		"jp": "コラッタ"
	},
	"Raticate": {
		"jp": "ラッタ"
	},
	"Spearow": {
		"jp": "オニスズメ"
	},
	"Fearow": {
		"jp": "オニドリル"
	},
	"Ekans": {
		"jp": "アーボ"
	},
	"Arbok": {
		"jp": "アーボック"
	},
	"Pichu": {
		"jp": "ピチュー"
	},
	"Pikachu": {
		"jp": "ピカチュウ"
	},
	"Raichu": {
		"jp": "ライチュウ"
	},
	"Sandshrew": {
		"jp": "サンド"
	},
	"Sandslash": {
		"jp": "サンドパン"
	},
	"Nidoran♀": {
		"jp": "ニドラン♀"
	},
	"Nidorina": {
		"jp": "ニドリーナ"
	},
	"Nidoqueen": {
		"jp": "ニドクイン"
	},
	"Nidoran♂": {
		"jp": "ニドラン♂"
	},
	"Nidorino": {
		"jp": "ニドリーノ"
	},
	"Nidoking": {
		"jp": "ニドキング"
	},
	"Cleffa": {
		"jp": "ピィ"
	},
	"Clefairy": {
		"jp": "ピッピ"
	},
	"Clefable": {
		"jp": "ピクシー"
	},
	"Vulpix": {
		"jp": "ロコン"
	},
	"Ninetales": {
		"jp": "キュウコン"
	},
	"Igglybuff": {
		"jp": "ププリン"
	},
	"Jigglypuff": {
		"jp": "プリン"
	},
	"Wigglytuff": {
		"jp": "プクリン"
	},
	"Zubat": {
		"jp": "ズバット"
	},
	"Golbat": {
		"jp": "ゴルバット"
	},
	"Crobat": {
		"jp": "クロバット"
	},
	"Oddish": {
		"jp": "ナゾノクサ"
	},
	"Gloom": {
		"jp": "クサイハナ"
	},
	"Vileplume": {
		"jp": "ラフレシア"
	},
	"Bellossom": {
		"jp": "キレイハナ"
	},
	"Paras": {
		"jp": "パラス"
	},
	"Parasect": {
		"jp": "パラセクト"
	},
	"Venonat": {
		"jp": "コンパン"
	},
	"Venomoth": {
		"jp": "モルフォン"
	},
	"Diglett": {
		"jp": "ディグダ"
	},
	"Dugtrio": {
		"jp": "ダグトリオ"
	},
	"Meowth": {
		"jp": "ニャース"
	},
	"Persian": {
		"jp": "ペルシアン"
	},
	"Psyduck": {
		"jp": "コダック"
	},
	"Golduck": {
		"jp": "ゴルダック"
	},
	"Mankey": {
		"jp": "マンキー"
	},
	"Primeape": {
		"jp": "オコリザル"
	},
	"Growlithe": {
		"jp": "ガーディ"
	},
	"Arcanine": {
		"jp": "ウインディ"
	},
	"Poliwag": {
		"jp": "ニョロモ"
	},
	"Poliwhirl": {
		"jp": "ニョロゾ"
	},
	"Poliwrath": {
		"jp": "ニョロボン"
	},
	"Politoed": {
		"jp": "ニョロトノ"
	},
	"Abra": {
		"jp": "ケーシィ"
	},
	"Kadabra": {
		"jp": "ユンゲラー"
	},
	"Alakazam": {
		"jp": "フーディン"
	},
	"Machop": {
		"jp": "ワンリキー"
	},
	"Machoke": {
		"jp": "ゴーリキー"
	},
	"Machamp": {
		"jp": "カイリキー"
	},
	"Bellsprout": {
		"jp": "マダツボミ"
	},
	"Weepinbell": {
		"jp": "ウツドン"
	},
	"Victreebel": {
		"jp": "ウツボット"
	},
	"Tentacool": {
		"jp": "メノクラゲ"
	},
	"Tentacruel": {
		"jp": "ドククラゲ"
	},
	"Geodude": {
		"jp": "イシツブテ"
	},
	"Graveler": {
		"jp": "ゴローン"
	},
	"Golem": {
		"jp": "ゴローニャ"
	},
	"Ponyta": {
		"jp": "ポニータ"
	},
	"Rapidash": {
		"jp": "ギャロップ"
	},
	"Slowpoke": {
		"jp": "ヤドン"
	},
	"Slowbro": {
		"jp": "ヤドラン"
	},
	"Slowking": {
		"jp": "ヤドキング"
	},
	"Magnemite": {
		"jp": "コイル"
	},
	"Magneton": {
		"jp": "レアコイル"
	},
	"Farfetch'd": {
		"jp": "カモネギ"
	},
	"Doduo": {
		"jp": "ドードー"
	},
	"Dodrio": {
		"jp": "ドードリオ"
	},
	"Seel": {
		"jp": "パウワウ"
	},
	"Dewgong": {
		"jp": "ジュゴン"
	},
	"Grimer": {
		"jp": "ベトベター"
	},
	"Muk": {
		"jp": "ベトベトン"
	},
	"Shellder": {
		"jp": "シェルダー"
	},
	"Cloyster": {
		"jp": "パルシェン"
	},
	"Gastly": {
		"jp": "ゴース"
	},
	"Haunter": {
		"jp": "ゴースト"
	},
	"Gengar": {
		"jp": "ゲンガー"
	},
	"Onix": {
		"jp": "イワーク"
	},
	"Steelix": {
		"jp": "ハガネール"
	},
	"Drowzee": {
		"jp": "スリープ"
	},
	"Hypno": {
		"jp": "スリーパー"
	},
	"Krabby": {
		"jp": "クラブ"
	},
	"Kingler": {
		"jp": "キングラー"
	},
	"Voltorb": {
		"jp": "ビリリダマ"
	},
	"Electrode": {
		"jp": "マルマイン"
	},
	"Exeggcute": {
		"jp": "タマタマ"
	},
	"Exeggutor": {
		"jp": "ナッシー"
	},
	"Cubone": {
		"jp": "カラカラ"
	},
	"Marowak": {
		"jp": "ガラガラ"
	},
	"Tyrogue": {
		"jp": "バルキー"
	},
	"Hitmonlee": {
		"jp": "サワムラー"
	},
	"Hitmonchan": {
		"jp": "エビワラー"
	},
	"Hitmontop": {
		"jp": "カポエラー"
	},
	"Lickitung": {
		"jp": "ベロリンガ"
	},
	"Koffing": {
		"jp": "ドガース"
	},
	"Weezing": {
		"jp": "マタドガス"
	},
	"Rhyhorn": {
		"jp": "サイホーン"
	},
	"Rhydon": {
		"jp": "サイドン"
	},
	"Chansey": {
		"jp": "ラッキー"
	},
	"Blissey": {
		"jp": "ハピナス"
	},
	"Tangela": {
		"jp": "モンジャラ"
	},
	"Kangaskhan": {
		"jp": "ガルーラ"
	},
	"Horsea": {
		"jp": "タッツー"
	},
	"Seadra": {
		"jp": "シードラ"
	},
	"Kingdra": {
		"jp": "キングドラ"
	},
	"Goldeen": {
		"jp": "トサキント"
	},
	"Seaking": {
		"jp": "アズマオウ"
	},
	"Staryu": {
		"jp": "ヒトデマン"
	},
	"Starmie": {
		"jp": "スターミー"
	},
	"Mr. Mime": {
		"jp": "バリヤード"
	},
	"Scyther": {
		"jp": "ストライク"
	},
	"Scizor": {
		"jp": "ハッサム"
	},
	"Smoochum": {
		"jp": "ムチュール"
	},
	"Jynx": {
		"jp": "ルージュラ"
	},
	"Elekid": {
		"jp": "エレキッド"
	},
	"Electabuzz": {
		"jp": "エレブー"
	},
	"Magby": {
		"jp": "ブビィ"
	},
	"Magmar": {
		"jp": "ブーバー"
	},
	"Pinsir": {
		"jp": "カイロス"
	},
	"Tauros": {
		"jp": "ケンタロス"
	},
	"Magikarp": {
		"jp": "コイキング"
	},
	"Gyarados": {
		"jp": "ギャラドス"
	},
	"Lapras": {
		"jp": "ラプラス"
	},
	"Ditto": {
		"jp": "メタモン"
	},
	"Eevee": {
		"jp": "イーブイ"
	},
	"Vaporeon": {
		"jp": "シャワーズ"
	},
	"Jolteon": {
		"jp": "サンダース"
	},
	"Flareon": {
		"jp": "ブースター"
	},
	"Espeon": {
		"jp": "エーフィ"
	},
	"Umbreon": {
		"jp": "ブラッキー"
	},
	"Porygon": {
		"jp": "ポリゴン"
	},
	"Porygon2": {
		"jp": "ポリゴン２"
	},
	"Omanyte": {
		"jp": "オムナイト"
	},
	"Omastar": {
		"jp": "オムスター"
	},
	"Kabuto": {
		"jp": "カブト"
	},
	"Kabutops": {
		"jp": "カブトプス"
	},
	"Aerodactyl": {
		"jp": "プテラ"
	},
	"Snorlax": {
		"jp": "カビゴン"
	},
	"Articuno": {
		"jp": "フリーザー"
	},
	"Zapdos": {
		"jp": "サンダー"
	},
	"Moltres": {
		"jp": "ファイヤー"
	},
	"Dratini": {
		"jp": "ミニリュウ"
	},
	"Dragonair": {
		"jp": "ハクリュー"
	},
	"Dragonite": {
		"jp": "カイリュー"
	},
	"Mewtwo": {
		"jp": "ミュウツー"
	},
	"Mew": {
		"jp": "ミュウ"
	},
	"Chikorita": {
		"jp": "チコリータ"
	},
	"Bayleef": {
		"jp": "ベイリーフ"
	},
	"Meganium": {
		"jp": "メガニウム"
	},
	"Cyndaquil": {
		"jp": "ヒノアラシ"
	},
	"Quilava": {
		"jp": "マグマラシ"
	},
	"Typhlosion": {
		"jp": "バクフーン"
	},
	"Totodile": {
		"jp": "ワニノコ"
	},
	"Croconaw": {
		"jp": "アリゲイツ"
	},
	"Feraligatr": {
		"jp": "オーダイル"
	},
	"Sentret": {
		"jp": "オタチ"
	},
	"Furret": {
		"jp": "オオタチ"
	},
	"Hoothoot": {
		"jp": "ホーホー"
	},
	"Noctowl": {
		"jp": "ヨルノズク"
	},
	"Ledyba": {
		"jp": "レディバ"
	},
	"Ledian": {
		"jp": "レディアン"
	},
	"Spinarak": {
		"jp": "イトマル"
	},
	"Ariados": {
		"jp": "アリアドス"
	},
	"Chinchou": {
		"jp": "チョンチー"
	},
	"Lanturn": {
		"jp": "ランターン"
	},
	"Togepi": {
		"jp": "トゲピー"
	},
	"Togetic": {
		"jp": "トゲチック"
	},
	"Natu": {
		"jp": "ネイティ"
	},
	"Xatu": {
		"jp": "ネイティオ"
	},
	"Mareep": {
		"jp": "メリープ"
	},
	"Flaaffy": {
		"jp": "モココ"
	},
	"Ampharos": {
		"jp": "デンリュウ"
	},
	"Marill": {
		"jp": "マリル"
	},
	"Azumarill": {
		"jp": "マリルリ"
	},
	"Sudowoodo": {
		"jp": "ウソッキー"
	},
	"Hoppip": {
		"jp": "ハネッコ"
	},
	"Skiploom": {
		"jp": "ポポッコ"
	},
	"Jumpluff": {
		"jp": "ワタッコ"
	},
	"Aipom": {
		"jp": "エイパム"
	},
	"Sunkern": {
		"jp": "ヒマナッツ"
	},
	"Sunflora": {
		"jp": "キマワリ"
	},
	"Yanma": {
		"jp": "ヤンヤンマ"
	},
	"Wooper": {
		"jp": "ウパー"
	},
	"Quagsire": {
		"jp": "ヌオー"
	},
	"Murkrow": {
		"jp": "ヤミカラス"
	},
	"Misdreavus": {
		"jp": "ムウマ"
	},
	"Unown": {
		"jp": "アンノーン"
	},
	"Wobbuffet": {
		"jp": "ソーナンス"
	},
	"Girafarig": {
		"jp": "キリンリキ"
	},
	"Pineco": {
		"jp": "クヌギダマ"
	},
	"Forretress": {
		"jp": "フォレトス"
	},
	"Dunsparce": {
		"jp": "ノコッチ"
	},
	"Gligar": {
		"jp": "グライガー"
	},
	"Snubbull": {
		"jp": "ブルー"
	},
	"Granbull": {
		"jp": "グランブル"
	},
	"Qwilfish": {
		"jp": "ハリーセン"
	},
	"Shuckle": {
		"jp": "ツボツボ"
	},
	"Heracross": {
		"jp": "ヘラクロス"
	},
	"Sneasel": {
		"jp": "ニューラ"
	},
	"Teddiursa": {
		"jp": "ヒメグマ"
	},
	"Ursaring": {
		"jp": "リングマ"
	},
	"Slugma": {
		"jp": "マグマッグ"
	},
	"Magcargo": {
		"jp": "マグカルゴ"
	},
	"Swinub": {
		"jp": "ウリムー"
	},
	"Piloswine": {
		"jp": "イノムー"
	},
	"Corsola": {
		"jp": "サニーゴ"
	},
	"Remoraid": {
		"jp": "テッポウオ"
	},
	"Octillery": {
		"jp": "オクタン"
	},
	"Delibird": {
		"jp": "デリバード"
	},
	"Mantine": {
		"jp": "マンタイン"
	},
	"Skarmory": {
		"jp": "エアームド"
	},
	"Houndour": {
		"jp": "デルビル"
	},
	"Houndoom": {
		"jp": "ヘルガー"
	},
	"Phanpy": {
		"jp": "ゴマゾウ"
	},
	"Donphan": {
		"jp": "ドンファン"
	},
	"Stantler": {
		"jp": "オドシシ"
	},
	"Smeargle": {
		"jp": "ドーブル"
	},
	"Miltank": {
		"jp": "ミルタンク"
	},
	"Raikou": {
		"jp": "ライコウ"
	},
	"Entei": {
		"jp": "エンテイ"
	},
	"Suicune": {
		"jp": "スイクン"
	},
	"Larvitar": {
		"jp": "ヨーギラス"
	},
	"Pupitar": {
		"jp": "サナギラス"
	},
	"Tyranitar": {
		"jp": "バンギラス"
	},
	"Lugia": {
		"jp": "ルギア"
	},
	"Ho-Oh": {
		"jp": "ホウオウ"
	},
	"Celebi": {
		"jp": "セレビィ"
	},
	"Struggle": {
		"jp": "わるあがき"
	},
	"Fury Cutter": {
		"jp": "れんぞくぎり"
	},
	"Bug Bite": {
		"jp": "むしくい"
	},
	"Bite": {
		"jp": "かみつく"
	},
	"Sucker Punch": {
		"jp": "ふいうち"
	},
	"Dragon Breath": {
		"jp": "りゅうのいぶき"
	},
	"Thunder Shock": {
		"jp": "でんきショック"
	},
	"Spark": {
		"jp": "スパーク"
	},
	"Low Kick": {
		"jp": "けたぐり"
	},
	"Karate Chop": {
		"jp": "からてチョップ"
	},
	"Ember": {
		"jp": "ひのこ"
	},
	"Wing Attack": {
		"jp": "つばさでうつ"
	},
	"Peck": {
		"jp": "つつく"
	},
	"Lick": {
		"jp": "したでなめる"
	},
	"Shadow Claw": {
		"jp": "シャドークロー"
	},
	"Vine Whip": {
		"jp": "つるのムチ"
	},
	"Razor Leaf": {
		"jp": "はっぱカッター"
	},
	"Mud Shot": {
		"jp": "マッドショット"
	},
	"Ice Shard": {
		"jp": "こおりのつぶて"
	},
	"Frost Breath": {
		"jp": "こおりのいぶき"
	},
	"Quick Attack": {
		"jp": "でんこうせっか"
	},
	"Scratch": {
		"jp": "ひっかく"
	},
	"Tackle": {
		"jp": "たいあたり"
	},
	"Pound": {
		"jp": "はたく"
	},
	"Cut": {
		"jp": "いあいぎり"
	},
	"Poison Jab": {
		"jp": "どくづき"
	},
	"Acid": {
		"jp": "ようかいえき"
	},
	"Psycho Cut": {
		"jp": "サイコカッター"
	},
	"Rock Throw": {
		"jp": "いわおとし"
	},
	"Metal Claw": {
		"jp": "メタルクロー"
	},
	"Bullet Punch": {
		"jp": "バレットパンチ"
	},
	"Water Gun": {
		"jp": "みずでっぽう"
	},
	"Splash": {
		"jp": "はねる"
	},
	"Mud Slap": {
		"jp": "どろかけ"
	},
	"Zen Headbutt": {
		"jp": "しねんのずつき"
	},
	"Confusion": {
		"jp": "ねんりき"
	},
	"Poison Sting": {
		"jp": "どくばり"
	},
	"Bubble": {
		"jp": "あわ"
	},
	"Feint Attack": {
		"jp": "だましうち"
	},
	"Steel Wing": {
		"jp": "はがねのつばさ"
	},
	"Fire Fang": {
		"jp": "ほのおのキバ"
	},
	"Rock Smash": {
		"jp": "いわくだき"
	},
	"Transform": {
		"jp": "へんしん"
	},
	"Counter": {
		"jp": "カウンター"
	},
	"Powder Snow": {
		"jp": "こなゆき"
	},
	"Charge Beam": {
		"jp": "チャージビーム"
	},
	"Volt Switch": {
		"jp": "ボルトチェンジ"
	},
	"Dragon Tail": {
		"jp": "ドラゴンテール"
	},
	"Air Slash": {
		"jp": "エアスラッシュ"
	},
	"Infestation": {
		"jp": "まとわりつく"
	},
	"Struggle Bug": {
		"jp": "むしのていこう"
	},
	"Astonish": {
		"jp": "おどろかす"
	},
	"Hex": {
		"jp": "たたりめ"
	},
	"Iron Tail": {
		"jp": "アイアンテール"
	},
	"Fire Spin": {
		"jp": "ほのおのうず"
	},
	"Bullet Seed": {
		"jp": "タネマシンガン"
	},
	"Extrasensory": {
		"jp": "じんつうりき"
	},
	"Snarl": {
		"jp": "バークアウト"
	},
	"Hidden Power": {
		"jp": "めざめるパワー"
	},
	"Wrap": {
		"jp": "まきつく"
	},
	"Hyper Beam": {
		"jp": "はかいこうせん"
	},
	"Dark Pulse": {
		"jp": "あくのはどう"
	},
	"Sludge": {
		"jp": "ヘドロこうげき"
	},
	"Vice Grip": {
		"jp": "はさむ"
	},
	"Flame Wheel": {
		"jp": "かえんぐるま"
	},
	"Megahorn": {
		"jp": "メガホーン"
	},
	"Flamethrower": {
		"jp": "かえんほうしゃ"
	},
	"Dig": {
		"jp": "あなをほる"
	},
	"Cross Chop": {
		"jp": "クロスチョップ"
	},
	"Psybeam": {
		"jp": "サイケこうせん"
	},
	"Earthquake": {
		"jp": "じしん"
	},
	"Stone Edge": {
		"jp": "ストーンエッジ"
	},
	"Ice Punch": {
		"jp": "れいとうパンチ"
	},
	"Discharge": {
		"jp": "ほうでん"
	},
	"Flash Cannon": {
		"jp": "ラスターカノン"
	},
	"Drill Peck": {
		"jp": "ドリルくちばし"
	},
	"Ice Beam": {
		"jp": "れいとうビーム"
	},
	"Blizzard": {
		"jp": "ふぶき"
	},
	"Heat Wave": {
		"jp": "ねっぷう"
	},
	"Aerial Ace": {
		"jp": "つばめがえし"
	},
	"Drill Run": {
		"jp": "ドリルライナー"
	},
	"Petal Blizzard": {
		"jp": "はなふぶき"
	},
	"Bug Buzz": {
		"jp": "むしのさざめき"
	},
	"Poison Fang": {
		"jp": "どくどくのキバ"
	},
	"Night Slash": {
		"jp": "つじぎり"
	},
	"Bubble Beam": {
		"jp": "バブルこうせん"
	},
	"Submission": {
		"jp": "じごくぐるま"
	},
	"Low Sweep": {
		"jp": "ローキック"
	},
	"Aqua Jet": {
		"jp": "アクアジェット"
	},
	"Aqua Tail": {
		"jp": "アクアテール"
	},
	"Seed Bomb": {
		"jp": "タネばくだん"
	},
	"Psyshock": {
		"jp": "サイコショック"
	},
	"Ancient Power": {
		"jp": "げんしのちから"
	},
	"Rock Tomb": {
		"jp": "がんせきふうじ"
	},
	"Rock Slide": {
		"jp": "いわなだれ"
	},
	"Power Gem": {
		"jp": "パワージェム"
	},
	"Ominous Wind": {
		"jp": "あやしいかぜ"
	},
	"Shadow Ball": {
		"jp": "シャドーボール"
	},
	"Magnet Bomb": {
		"jp": "マグネットボム"
	},
	"Iron Head": {
		"jp": "アイアンヘッド"
	},
	"Thunder Punch": {
		"jp": "かみなりパンチ"
	},
	"Thunder": {
		"jp": "かみなり"
	},
	"Thunderbolt": {
		"jp": "１０まんボルト"
	},
	"Twister": {
		"jp": "たつまき"
	},
	"Dragon Pulse": {
		"jp": "りゅうのはどう"
	},
	"Dragon Claw": {
		"jp": "ドラゴンクロー"
	},
	"Disarming Voice": {
		"jp": "チャームボイス"
	},
	"Draining Kiss": {
		"jp": "ドレインキッス"
	},
	"Dazzling Gleam": {
		"jp": "マジカルシャイン"
	},
	"Moonblast": {
		"jp": "ムーンフォース"
	},
	"Play Rough": {
		"jp": "じゃれつく"
	},
	"Cross Poison": {
		"jp": "クロスポイズン"
	},
	"Sludge Bomb": {
		"jp": "ヘドロばくだん"
	},
	"Sludge Wave": {
		"jp": "ヘドロウェーブ"
	},
	"Gunk Shot": {
		"jp": "ダストシュート"
	},
	"Bone Club": {
		"jp": "ホネこんぼう"
	},
	"Bulldoze": {
		"jp": "じならし"
	},
	"Mud Bomb": {
		"jp": "どろばくだん"
	},
	"Signal Beam": {
		"jp": "シグナルビーム"
	},
	"X-Scissor": {
		"jp": "シザークロス"
	},
	"Flame Charge": {
		"jp": "ニトロチャージ"
	},
	"Flame Burst": {
		"jp": "はじけるほのお"
	},
	"Fire Blast": {
		"jp": "だいもんじ"
	},
	"Brine": {
		"jp": "しおみず"
	},
	"Water Pulse": {
		"jp": "みずのはどう"
	},
	"Scald": {
		"jp": "ねっとう"
	},
	"Hydro Pump": {
		"jp": "ハイドロポンプ"
	},
	"Psychic": {
		"jp": "サイコキネシス"
	},
	"Icy Wind": {
		"jp": "こごえるかぜ"
	},
	"Fire Punch": {
		"jp": "ほのおのパンチ"
	},
	"Solar Beam": {
		"jp": "ソーラービーム"
	},
	"Leaf Blade": {
		"jp": "リーフブレード"
	},
	"Power Whip": {
		"jp": "パワーウィップ"
	},
	"Air Cutter": {
		"jp": "エアカッター"
	},
	"Hurricane": {
		"jp": "ぼうふう"
	},
	"Brick Break": {
		"jp": "かわらわり"
	},
	"Swift": {
		"jp": "スピードスター"
	},
	"Horn Attack": {
		"jp": "つのでつく"
	},
	"Stomp": {
		"jp": "ふみつけ"
	},
	"Hyper Fang": {
		"jp": "ひっさつまえば"
	},
	"Body Slam": {
		"jp": "のしかかり"
	},
	"Close Combat": {
		"jp": "インファイト"
	},
	"Dynamic Punch": {
		"jp": "ばくれつパンチ"
	},
	"Focus Blast": {
		"jp": "きあいだま"
	},
	"Aurora Beam": {
		"jp": "オーロラビーム"
	},
	"Wild Charge": {
		"jp": "ワイルドボルト"
	},
	"Zap Cannon": {
		"jp": "でんじほう"
	},
	"Avalanche": {
		"jp": "ゆきなだれ"
	},
	"Brave Bird": {
		"jp": "ブレイブバード"
	},
	"Sky Attack": {
		"jp": "ゴッドバード"
	},
	"Sand Tomb": {
		"jp": "すなじごく"
	},
	"Rock Blast": {
		"jp": "ロックブラスト"
	},
	"Silver Wind": {
		"jp": "ぎんいろのかぜ"
	},
	"Night Shade": {
		"jp": "ナイトヘッド"
	},
	"Gyro Ball": {
		"jp": "ジャイロボール"
	},
	"Heavy Slam": {
		"jp": "ヘビーボンバー"
	},
	"Overheat": {
		"jp": "オーバーヒート"
	},
	"Grass Knot": {
		"jp": "くさむすび"
	},
	"Energy Ball": {
		"jp": "エナジーボール"
	},
	"Future Sight": {
		"jp": "みらいよち"
	},
	"Mirror Coat": {
		"jp": "ミラーコート"
	},
	"Outrage": {
		"jp": "げきりん"
	},
	"Crunch": {
		"jp": "かみくだく"
	},
	"Foul Play": {
		"jp": "イカサマ"
	},
	"フシギダネ": {},
	"フシギソウ": {},
	"フシギバナ": {},
	"ヒトカゲ": {},
	"リザード": {},
	"リザードン": {},
	"ゼニガメ": {},
	"カメール": {},
	"カメックス": {},
	"キャタピー": {},
	"トランセル": {},
	"バタフリー": {},
	"ビードル": {},
	"コクーン": {},
	"スピアー": {},
	"ポッポ": {},
	"ピジョン": {},
	"ピジョット": {},
	"コラッタ": {},
	"ラッタ": {},
	"オニスズメ": {},
	"オニドリル": {},
	"アーボ": {},
	"アーボック": {},
	"ピチュー": {},
	"ピカチュウ": {},
	"ライチュウ": {},
	"サンド": {},
	"サンドパン": {},
	"ニドラン♀": {},
	"ニドリーナ": {},
	"ニドクイン": {},
	"ニドラン♂": {},
	"ニドリーノ": {},
	"ニドキング": {},
	"ピィ": {},
	"ピッピ": {},
	"ピクシー": {},
	"ロコン": {},
	"キュウコン": {},
	"ププリン": {},
	"プリン": {},
	"プクリン": {},
	"ズバット": {},
	"ゴルバット": {},
	"クロバット": {},
	"ナゾノクサ": {},
	"クサイハナ": {},
	"ラフレシア": {},
	"キレイハナ": {},
	"パラス": {},
	"パラセクト": {},
	"コンパン": {},
	"モルフォン": {},
	"ディグダ": {},
	"ダグトリオ": {},
	"ニャース": {},
	"ペルシアン": {},
	"コダック": {},
	"ゴルダック": {},
	"マンキー": {},
	"オコリザル": {},
	"ガーディ": {},
	"ウインディ": {},
	"ニョロモ": {},
	"ニョロゾ": {},
	"ニョロボン": {},
	"ニョロトノ": {},
	"ケーシィ": {},
	"ユンゲラー": {},
	"フーディン": {},
	"ワンリキー": {},
	"ゴーリキー": {},
	"カイリキー": {},
	"マダツボミ": {},
	"ウツドン": {},
	"ウツボット": {},
	"メノクラゲ": {},
	"ドククラゲ": {},
	"イシツブテ": {},
	"ゴローン": {},
	"ゴローニャ": {},
	"ポニータ": {},
	"ギャロップ": {},
	"ヤドン": {},
	"ヤドラン": {},
	"ヤドキング": {},
	"コイル": {},
	"レアコイル": {},
	"カモネギ": {},
	"ドードー": {},
	"ドードリオ": {},
	"パウワウ": {},
	"ジュゴン": {},
	"ベトベター": {},
	"ベトベトン": {},
	"シェルダー": {},
	"パルシェン": {},
	"ゴース": {},
	"ゴースト": {},
	"ゲンガー": {},
	"イワーク": {},
	"ハガネール": {},
	"スリープ": {},
	"スリーパー": {},
	"クラブ": {},
	"キングラー": {},
	"ビリリダマ": {},
	"マルマイン": {},
	"タマタマ": {},
	"ナッシー": {},
	"カラカラ": {},
	"ガラガラ": {},
	"バルキー": {},
	"サワムラー": {},
	"エビワラー": {},
	"カポエラー": {},
	"ベロリンガ": {},
	"ドガース": {},
	"マタドガス": {},
	"サイホーン": {},
	"サイドン": {},
	"ラッキー": {},
	"ハピナス": {},
	"モンジャラ": {},
	"ガルーラ": {},
	"タッツー": {},
	"シードラ": {},
	"キングドラ": {},
	"トサキント": {},
	"アズマオウ": {},
	"ヒトデマン": {},
	"スターミー": {},
	"バリヤード": {},
	"ストライク": {},
	"ハッサム": {},
	"ムチュール": {},
	"ルージュラ": {},
	"エレキッド": {},
	"エレブー": {},
	"ブビィ": {},
	"ブーバー": {},
	"カイロス": {},
	"ケンタロス": {},
	"コイキング": {},
	"ギャラドス": {},
	"ラプラス": {},
	"メタモン": {},
	"イーブイ": {},
	"シャワーズ": {},
	"サンダース": {},
	"ブースター": {},
	"エーフィ": {},
	"ブラッキー": {},
	"ポリゴン": {},
	"ポリゴン２": {},
	"オムナイト": {},
	"オムスター": {},
	"カブト": {},
	"カブトプス": {},
	"プテラ": {},
	"カビゴン": {},
	"フリーザー": {},
	"サンダー": {},
	"ファイヤー": {},
	"ミニリュウ": {},
	"ハクリュー": {},
	"カイリュー": {},
	"ミュウツー": {},
	"ミュウ": {},
	"チコリータ": {},
	"ベイリーフ": {},
	"メガニウム": {},
	"ヒノアラシ": {},
	"マグマラシ": {},
	"バクフーン": {},
	"ワニノコ": {},
	"アリゲイツ": {},
	"オーダイル": {},
	"オタチ": {},
	"オオタチ": {},
	"ホーホー": {},
	"ヨルノズク": {},
	"レディバ": {},
	"レディアン": {},
	"イトマル": {},
	"アリアドス": {},
	"チョンチー": {},
	"ランターン": {},
	"トゲピー": {},
	"トゲチック": {},
	"ネイティ": {},
	"ネイティオ": {},
	"メリープ": {},
	"モココ": {},
	"デンリュウ": {},
	"マリル": {},
	"マリルリ": {},
	"ウソッキー": {},
	"ハネッコ": {},
	"ポポッコ": {},
	"ワタッコ": {},
	"エイパム": {},
	"ヒマナッツ": {},
	"キマワリ": {},
	"ヤンヤンマ": {},
	"ウパー": {},
	"ヌオー": {},
	"ヤミカラス": {},
	"ムウマ": {},
	"アンノーン": {},
	"ソーナンス": {},
	"キリンリキ": {},
	"クヌギダマ": {},
	"フォレトス": {},
	"ノコッチ": {},
	"グライガー": {},
	"ブルー": {},
	"グランブル": {},
	"ハリーセン": {},
	"ツボツボ": {},
	"ヘラクロス": {},
	"ニューラ": {},
	"ヒメグマ": {},
	"リングマ": {},
	"マグマッグ": {},
	"マグカルゴ": {},
	"ウリムー": {},
	"イノムー": {},
	"サニーゴ": {},
	"テッポウオ": {},
	"オクタン": {},
	"デリバード": {},
	"マンタイン": {},
	"エアームド": {},
	"デルビル": {},
	"ヘルガー": {},
	"ゴマゾウ": {},
	"ドンファン": {},
	"オドシシ": {},
	"ドーブル": {},
	"ミルタンク": {},
	"ライコウ": {},
	"エンテイ": {},
	"スイクン": {},
	"ヨーギラス": {},
	"サナギラス": {},
	"バンギラス": {},
	"ルギア": {},
	"ホウオウ": {},
	"セレビィ": {},
	"わるあがき": {},
	"れんぞくぎり": {},
	"むしくい": {},
	"かみつく": {},
	"ふいうち": {},
	"りゅうのいぶき": {},
	"でんきショック": {},
	"スパーク": {},
	"けたぐり": {},
	"からてチョップ": {},
	"ひのこ": {},
	"つばさでうつ": {},
	"つつく": {},
	"したでなめる": {},
	"シャドークロー": {},
	"つるのムチ": {},
	"はっぱカッター": {},
	"マッドショット": {},
	"こおりのつぶて": {},
	"こおりのいぶき": {},
	"でんこうせっか": {},
	"ひっかく": {},
	"たいあたり": {},
	"はたく": {},
	"いあいぎり": {},
	"どくづき": {},
	"ようかいえき": {},
	"サイコカッター": {},
	"いわおとし": {},
	"メタルクロー": {},
	"バレットパンチ": {},
	"みずでっぽう": {},
	"はねる": {},
	"どろかけ": {},
	"しねんのずつき": {},
	"ねんりき": {},
	"どくばり": {},
	"あわ": {},
	"だましうち": {},
	"はがねのつばさ": {},
	"ほのおのキバ": {},
	"いわくだき": {},
	"へんしん": {},
	"カウンター": {},
	"こなゆき": {},
	"チャージビーム": {},
	"ボルトチェンジ": {},
	"ドラゴンテール": {},
	"エアスラッシュ": {},
	"まとわりつく": {},
	"むしのていこう": {},
	"おどろかす": {},
	"たたりめ": {},
	"アイアンテール": {},
	"ほのおのうず": {},
	"タネマシンガン": {},
	"じんつうりき": {},
	"バークアウト": {},
	"めざめるパワー": {},
	"まきつく": {},
	"はかいこうせん": {},
	"あくのはどう": {},
	"ヘドロこうげき": {},
	"はさむ": {},
	"かえんぐるま": {},
	"メガホーン": {},
	"かえんほうしゃ": {},
	"あなをほる": {},
	"クロスチョップ": {},
	"サイケこうせん": {},
	"じしん": {},
	"ストーンエッジ": {},
	"れいとうパンチ": {},
	"ほうでん": {},
	"ラスターカノン": {},
	"ドリルくちばし": {},
	"れいとうビーム": {},
	"ふぶき": {},
	"ねっぷう": {},
	"つばめがえし": {},
	"ドリルライナー": {},
	"はなふぶき": {},
	"むしのさざめき": {},
	"どくどくのキバ": {},
	"つじぎり": {},
	"バブルこうせん": {},
	"じごくぐるま": {},
	"ローキック": {},
	"アクアジェット": {},
	"アクアテール": {},
	"タネばくだん": {},
	"サイコショック": {},
	"げんしのちから": {},
	"がんせきふうじ": {},
	"いわなだれ": {},
	"パワージェム": {},
	"あやしいかぜ": {},
	"シャドーボール": {},
	"マグネットボム": {},
	"アイアンヘッド": {},
	"かみなりパンチ": {},
	"かみなり": {},
	"１０まんボルト": {},
	"たつまき": {},
	"りゅうのはどう": {},
	"ドラゴンクロー": {},
	"チャームボイス": {},
	"ドレインキッス": {},
	"マジカルシャイン": {},
	"ムーンフォース": {},
	"じゃれつく": {},
	"クロスポイズン": {},
	"ヘドロばくだん": {},
	"ヘドロウェーブ": {},
	"ダストシュート": {},
	"ホネこんぼう": {},
	"じならし": {},
	"どろばくだん": {},
	"シグナルビーム": {},
	"シザークロス": {},
	"ニトロチャージ": {},
	"はじけるほのお": {},
	"だいもんじ": {},
	"しおみず": {},
	"みずのはどう": {},
	"ねっとう": {},
	"ハイドロポンプ": {},
	"サイコキネシス": {},
	"こごえるかぜ": {},
	"ほのおのパンチ": {},
	"ソーラービーム": {},
	"リーフブレード": {},
	"パワーウィップ": {},
	"エアカッター": {},
	"ぼうふう": {},
	"かわらわり": {},
	"スピードスター": {},
	"つのでつく": {},
	"ふみつけ": {},
	"ひっさつまえば": {},
	"のしかかり": {},
	"インファイト": {},
	"ばくれつパンチ": {},
	"きあいだま": {},
	"オーロラビーム": {},
	"ワイルドボルト": {},
	"でんじほう": {},
	"ゆきなだれ": {},
	"ブレイブバード": {},
	"ゴッドバード": {},
	"すなじごく": {},
	"ロックブラスト": {},
	"ぎんいろのかぜ": {},
	"ナイトヘッド": {},
	"ジャイロボール": {},
	"ヘビーボンバー": {},
	"オーバーヒート": {},
	"くさむすび": {},
	"エナジーボール": {},
	"みらいよち": {},
	"ミラーコート": {},
	"げきりん": {},
	"かみくだく": {},
	"イカサマ": {}
}"
JSON.stringify(name_maps,null,'\t')var name_maps = {};
var gap = name_list.length/2;
for(var i = 0 ; i < gap ; i++){
	var name_map = {};
	name_map["jp"] = name_list[i+gap];
	name_maps[name_list[i]] = name_map
}
VM1659:1 Uncaught SyntaxError: Unexpected token var
var gap = name_list.length/2;
for(var i = 0 ; i < gap ; i++){
	var name_map = {};
	name_map["jp"] = name_list[i+gap];
	name_maps[name_list[i]] = name_map;
}
Objectjp: "イカサマ"__proto__: Object
var name_maps = {};
var gap = name_list.length/2;
for(var i = 0 ; i < gap ; i++){
	var name_map = {};
	name_map["jp"] = name_list[i+gap];
	name_maps[name_list[i]] = name_map
}
Object {jp: "イカサマ"}
name_list.length/2
417
var name_maps = {};
var gap = name_list.length/2;
for(var i = 0 ; i < gap ; i++){
	name_maps[name_list[i]]["jp"]= name_list[i+gap]
}
VM1681:4 Uncaught TypeError: Cannot set property 'jp' of undefined
    at <anonymous>:4:31
(anonymous) @ VM1681:4
var name_maps = {};
var gap = name_list.length/2;
for(var i = 0 ; i < gap ; i++){
	var name_map = {};
	name_map["jp"] = name_list[i+gap];
	name_maps[name_list[i]] = name_map
}
Object {jp: "イカサマ"}
var name_maps = {};
var gap = name_list.length/2;
for(var i = 0 ; i <= name_list.length-1 ; i++){
	var name_map = {};
	name_map["jp"] = name_list[i+gap];
	name_maps[name_list[i]] = name_map
}
Object {jp: undefined}jp: undefined__proto__: Object__defineGetter__: __defineGetter__()__defineSetter__: __defineSetter__()__lookupGetter__: __lookupGetter__()__lookupSetter__: __lookupSetter__()constructor: Object()hasOwnProperty: hasOwnProperty()isPrototypeOf: isPrototypeOf()propertyIsEnumerable: propertyIsEnumerable()toLocaleString: toLocaleString()toString: toString()valueOf: valueOf()get __proto__: __proto__()set __proto__: __proto__()
JSON.stringify(name_maps,null,'\t')
"{
	"Bulbasaur": {
		"jp": "フシギダネ"
	},
	"Ivysaur": {
		"jp": "フシギソウ"
	},
	"Venusaur": {
		"jp": "フシギバナ"
	},
	"Charmander": {
		"jp": "ヒトカゲ"
	},
	"Charmeleon": {
		"jp": "リザード"
	},
	"Charizard": {
		"jp": "リザードン"
	},
	"Squirtle": {
		"jp": "ゼニガメ"
	},
	"Wartortle": {
		"jp": "カメール"
	},
	"Blastoise": {
		"jp": "カメックス"
	},
	"Caterpie": {
		"jp": "キャタピー"
	},
	"Metapod": {
		"jp": "トランセル"
	},
	"Butterfree": {
		"jp": "バタフリー"
	},
	"Weedle": {
		"jp": "ビードル"
	},
	"Kakuna": {
		"jp": "コクーン"
	},
	"Beedrill": {
		"jp": "スピアー"
	},
	"Pidgey": {
		"jp": "ポッポ"
	},
	"Pidgeotto": {
		"jp": "ピジョン"
	},
	"Pidgeot": {
		"jp": "ピジョット"
	},
	"Rattata": {
		"jp": "コラッタ"
	},
	"Raticate": {
		"jp": "ラッタ"
	},
	"Spearow": {
		"jp": "オニスズメ"
	},
	"Fearow": {
		"jp": "オニドリル"
	},
	"Ekans": {
		"jp": "アーボ"
	},
	"Arbok": {
		"jp": "アーボック"
	},
	"Pichu": {
		"jp": "ピチュー"
	},
	"Pikachu": {
		"jp": "ピカチュウ"
	},
	"Raichu": {
		"jp": "ライチュウ"
	},
	"Sandshrew": {
		"jp": "サンド"
	},
	"Sandslash": {
		"jp": "サンドパン"
	},
	"Nidoran♀": {
		"jp": "ニドラン♀"
	},
	"Nidorina": {
		"jp": "ニドリーナ"
	},
	"Nidoqueen": {
		"jp": "ニドクイン"
	},
	"Nidoran♂": {
		"jp": "ニドラン♂"
	},
	"Nidorino": {
		"jp": "ニドリーノ"
	},
	"Nidoking": {
		"jp": "ニドキング"
	},
	"Cleffa": {
		"jp": "ピィ"
	},
	"Clefairy": {
		"jp": "ピッピ"
	},
	"Clefable": {
		"jp": "ピクシー"
	},
	"Vulpix": {
		"jp": "ロコン"
	},
	"Ninetales": {
		"jp": "キュウコン"
	},
	"Igglybuff": {
		"jp": "ププリン"
	},
	"Jigglypuff": {
		"jp": "プリン"
	},
	"Wigglytuff": {
		"jp": "プクリン"
	},
	"Zubat": {
		"jp": "ズバット"
	},
	"Golbat": {
		"jp": "ゴルバット"
	},
	"Crobat": {
		"jp": "クロバット"
	},
	"Oddish": {
		"jp": "ナゾノクサ"
	},
	"Gloom": {
		"jp": "クサイハナ"
	},
	"Vileplume": {
		"jp": "ラフレシア"
	},
	"Bellossom": {
		"jp": "キレイハナ"
	},
	"Paras": {
		"jp": "パラス"
	},
	"Parasect": {
		"jp": "パラセクト"
	},
	"Venonat": {
		"jp": "コンパン"
	},
	"Venomoth": {
		"jp": "モルフォン"
	},
	"Diglett": {
		"jp": "ディグダ"
	},
	"Dugtrio": {
		"jp": "ダグトリオ"
	},
	"Meowth": {
		"jp": "ニャース"
	},
	"Persian": {
		"jp": "ペルシアン"
	},
	"Psyduck": {
		"jp": "コダック"
	},
	"Golduck": {
		"jp": "ゴルダック"
	},
	"Mankey": {
		"jp": "マンキー"
	},
	"Primeape": {
		"jp": "オコリザル"
	},
	"Growlithe": {
		"jp": "ガーディ"
	},
	"Arcanine": {
		"jp": "ウインディ"
	},
	"Poliwag": {
		"jp": "ニョロモ"
	},
	"Poliwhirl": {
		"jp": "ニョロゾ"
	},
	"Poliwrath": {
		"jp": "ニョロボン"
	},
	"Politoed": {
		"jp": "ニョロトノ"
	},
	"Abra": {
		"jp": "ケーシィ"
	},
	"Kadabra": {
		"jp": "ユンゲラー"
	},
	"Alakazam": {
		"jp": "フーディン"
	},
	"Machop": {
		"jp": "ワンリキー"
	},
	"Machoke": {
		"jp": "ゴーリキー"
	},
	"Machamp": {
		"jp": "カイリキー"
	},
	"Bellsprout": {
		"jp": "マダツボミ"
	},
	"Weepinbell": {
		"jp": "ウツドン"
	},
	"Victreebel": {
		"jp": "ウツボット"
	},
	"Tentacool": {
		"jp": "メノクラゲ"
	},
	"Tentacruel": {
		"jp": "ドククラゲ"
	},
	"Geodude": {
		"jp": "イシツブテ"
	},
	"Graveler": {
		"jp": "ゴローン"
	},
	"Golem": {
		"jp": "ゴローニャ"
	},
	"Ponyta": {
		"jp": "ポニータ"
	},
	"Rapidash": {
		"jp": "ギャロップ"
	},
	"Slowpoke": {
		"jp": "ヤドン"
	},
	"Slowbro": {
		"jp": "ヤドラン"
	},
	"Slowking": {
		"jp": "ヤドキング"
	},
	"Magnemite": {
		"jp": "コイル"
	},
	"Magneton": {
		"jp": "レアコイル"
	},
	"Farfetch'd": {
		"jp": "カモネギ"
	},
	"Doduo": {
		"jp": "ドードー"
	},
	"Dodrio": {
		"jp": "ドードリオ"
	},
	"Seel": {
		"jp": "パウワウ"
	},
	"Dewgong": {
		"jp": "ジュゴン"
	},
	"Grimer": {
		"jp": "ベトベター"
	},
	"Muk": {
		"jp": "ベトベトン"
	},
	"Shellder": {
		"jp": "シェルダー"
	},
	"Cloyster": {
		"jp": "パルシェン"
	},
	"Gastly": {
		"jp": "ゴース"
	},
	"Haunter": {
		"jp": "ゴースト"
	},
	"Gengar": {
		"jp": "ゲンガー"
	},
	"Onix": {
		"jp": "イワーク"
	},
	"Steelix": {
		"jp": "ハガネール"
	},
	"Drowzee": {
		"jp": "スリープ"
	},
	"Hypno": {
		"jp": "スリーパー"
	},
	"Krabby": {
		"jp": "クラブ"
	},
	"Kingler": {
		"jp": "キングラー"
	},
	"Voltorb": {
		"jp": "ビリリダマ"
	},
	"Electrode": {
		"jp": "マルマイン"
	},
	"Exeggcute": {
		"jp": "タマタマ"
	},
	"Exeggutor": {
		"jp": "ナッシー"
	},
	"Cubone": {
		"jp": "カラカラ"
	},
	"Marowak": {
		"jp": "ガラガラ"
	},
	"Tyrogue": {
		"jp": "バルキー"
	},
	"Hitmonlee": {
		"jp": "サワムラー"
	},
	"Hitmonchan": {
		"jp": "エビワラー"
	},
	"Hitmontop": {
		"jp": "カポエラー"
	},
	"Lickitung": {
		"jp": "ベロリンガ"
	},
	"Koffing": {
		"jp": "ドガース"
	},
	"Weezing": {
		"jp": "マタドガス"
	},
	"Rhyhorn": {
		"jp": "サイホーン"
	},
	"Rhydon": {
		"jp": "サイドン"
	},
	"Chansey": {
		"jp": "ラッキー"
	},
	"Blissey": {
		"jp": "ハピナス"
	},
	"Tangela": {
		"jp": "モンジャラ"
	},
	"Kangaskhan": {
		"jp": "ガルーラ"
	},
	"Horsea": {
		"jp": "タッツー"
	},
	"Seadra": {
		"jp": "シードラ"
	},
	"Kingdra": {
		"jp": "キングドラ"
	},
	"Goldeen": {
		"jp": "トサキント"
	},
	"Seaking": {
		"jp": "アズマオウ"
	},
	"Staryu": {
		"jp": "ヒトデマン"
	},
	"Starmie": {
		"jp": "スターミー"
	},
	"Mr. Mime": {
		"jp": "バリヤード"
	},
	"Scyther": {
		"jp": "ストライク"
	},
	"Scizor": {
		"jp": "ハッサム"
	},
	"Smoochum": {
		"jp": "ムチュール"
	},
	"Jynx": {
		"jp": "ルージュラ"
	},
	"Elekid": {
		"jp": "エレキッド"
	},
	"Electabuzz": {
		"jp": "エレブー"
	},
	"Magby": {
		"jp": "ブビィ"
	},
	"Magmar": {
		"jp": "ブーバー"
	},
	"Pinsir": {
		"jp": "カイロス"
	},
	"Tauros": {
		"jp": "ケンタロス"
	},
	"Magikarp": {
		"jp": "コイキング"
	},
	"Gyarados": {
		"jp": "ギャラドス"
	},
	"Lapras": {
		"jp": "ラプラス"
	},
	"Ditto": {
		"jp": "メタモン"
	},
	"Eevee": {
		"jp": "イーブイ"
	},
	"Vaporeon": {
		"jp": "シャワーズ"
	},
	"Jolteon": {
		"jp": "サンダース"
	},
	"Flareon": {
		"jp": "ブースター"
	},
	"Espeon": {
		"jp": "エーフィ"
	},
	"Umbreon": {
		"jp": "ブラッキー"
	},
	"Porygon": {
		"jp": "ポリゴン"
	},
	"Porygon2": {
		"jp": "ポリゴン２"
	},
	"Omanyte": {
		"jp": "オムナイト"
	},
	"Omastar": {
		"jp": "オムスター"
	},
	"Kabuto": {
		"jp": "カブト"
	},
	"Kabutops": {
		"jp": "カブトプス"
	},
	"Aerodactyl": {
		"jp": "プテラ"
	},
	"Snorlax": {
		"jp": "カビゴン"
	},
	"Articuno": {
		"jp": "フリーザー"
	},
	"Zapdos": {
		"jp": "サンダー"
	},
	"Moltres": {
		"jp": "ファイヤー"
	},
	"Dratini": {
		"jp": "ミニリュウ"
	},
	"Dragonair": {
		"jp": "ハクリュー"
	},
	"Dragonite": {
		"jp": "カイリュー"
	},
	"Mewtwo": {
		"jp": "ミュウツー"
	},
	"Mew": {
		"jp": "ミュウ"
	},
	"Chikorita": {
		"jp": "チコリータ"
	},
	"Bayleef": {
		"jp": "ベイリーフ"
	},
	"Meganium": {
		"jp": "メガニウム"
	},
	"Cyndaquil": {
		"jp": "ヒノアラシ"
	},
	"Quilava": {
		"jp": "マグマラシ"
	},
	"Typhlosion": {
		"jp": "バクフーン"
	},
	"Totodile": {
		"jp": "ワニノコ"
	},
	"Croconaw": {
		"jp": "アリゲイツ"
	},
	"Feraligatr": {
		"jp": "オーダイル"
	},
	"Sentret": {
		"jp": "オタチ"
	},
	"Furret": {
		"jp": "オオタチ"
	},
	"Hoothoot": {
		"jp": "ホーホー"
	},
	"Noctowl": {
		"jp": "ヨルノズク"
	},
	"Ledyba": {
		"jp": "レディバ"
	},
	"Ledian": {
		"jp": "レディアン"
	},
	"Spinarak": {
		"jp": "イトマル"
	},
	"Ariados": {
		"jp": "アリアドス"
	},
	"Chinchou": {
		"jp": "チョンチー"
	},
	"Lanturn": {
		"jp": "ランターン"
	},
	"Togepi": {
		"jp": "トゲピー"
	},
	"Togetic": {
		"jp": "トゲチック"
	},
	"Natu": {
		"jp": "ネイティ"
	},
	"Xatu": {
		"jp": "ネイティオ"
	},
	"Mareep": {
		"jp": "メリープ"
	},
	"Flaaffy": {
		"jp": "モココ"
	},
	"Ampharos": {
		"jp": "デンリュウ"
	},
	"Marill": {
		"jp": "マリル"
	},
	"Azumarill": {
		"jp": "マリルリ"
	},
	"Sudowoodo": {
		"jp": "ウソッキー"
	},
	"Hoppip": {
		"jp": "ハネッコ"
	},
	"Skiploom": {
		"jp": "ポポッコ"
	},
	"Jumpluff": {
		"jp": "ワタッコ"
	},
	"Aipom": {
		"jp": "エイパム"
	},
	"Sunkern": {
		"jp": "ヒマナッツ"
	},
	"Sunflora": {
		"jp": "キマワリ"
	},
	"Yanma": {
		"jp": "ヤンヤンマ"
	},
	"Wooper": {
		"jp": "ウパー"
	},
	"Quagsire": {
		"jp": "ヌオー"
	},
	"Murkrow": {
		"jp": "ヤミカラス"
	},
	"Misdreavus": {
		"jp": "ムウマ"
	},
	"Unown": {
		"jp": "アンノーン"
	},
	"Wobbuffet": {
		"jp": "ソーナンス"
	},
	"Girafarig": {
		"jp": "キリンリキ"
	},
	"Pineco": {
		"jp": "クヌギダマ"
	},
	"Forretress": {
		"jp": "フォレトス"
	},
	"Dunsparce": {
		"jp": "ノコッチ"
	},
	"Gligar": {
		"jp": "グライガー"
	},
	"Snubbull": {
		"jp": "ブルー"
	},
	"Granbull": {
		"jp": "グランブル"
	},
	"Qwilfish": {
		"jp": "ハリーセン"
	},
	"Shuckle": {
		"jp": "ツボツボ"
	},
	"Heracross": {
		"jp": "ヘラクロス"
	},
	"Sneasel": {
		"jp": "ニューラ"
	},
	"Teddiursa": {
		"jp": "ヒメグマ"
	},
	"Ursaring": {
		"jp": "リングマ"
	},
	"Slugma": {
		"jp": "マグマッグ"
	},
	"Magcargo": {
		"jp": "マグカルゴ"
	},
	"Swinub": {
		"jp": "ウリムー"
	},
	"Piloswine": {
		"jp": "イノムー"
	},
	"Corsola": {
		"jp": "サニーゴ"
	},
	"Remoraid": {
		"jp": "テッポウオ"
	},
	"Octillery": {
		"jp": "オクタン"
	},
	"Delibird": {
		"jp": "デリバード"
	},
	"Mantine": {
		"jp": "マンタイン"
	},
	"Skarmory": {
		"jp": "エアームド"
	},
	"Houndour": {
		"jp": "デルビル"
	},
	"Houndoom": {
		"jp": "ヘルガー"
	},
	"Phanpy": {
		"jp": "ゴマゾウ"
	},
	"Donphan": {
		"jp": "ドンファン"
	},
	"Stantler": {
		"jp": "オドシシ"
	},
	"Smeargle": {
		"jp": "ドーブル"
	},
	"Miltank": {
		"jp": "ミルタンク"
	},
	"Raikou": {
		"jp": "ライコウ"
	},
	"Entei": {
		"jp": "エンテイ"
	},
	"Suicune": {
		"jp": "スイクン"
	},
	"Larvitar": {
		"jp": "ヨーギラス"
	},
	"Pupitar": {
		"jp": "サナギラス"
	},
	"Tyranitar": {
		"jp": "バンギラス"
	},
	"Lugia": {
		"jp": "ルギア"
	},
	"Ho-Oh": {
		"jp": "ホウオウ"
	},
	"Celebi": {
		"jp": "セレビィ"
	},
	"Struggle": {
		"jp": "わるあがき"
	},
	"Fury Cutter": {
		"jp": "れんぞくぎり"
	},
	"Bug Bite": {
		"jp": "むしくい"
	},
	"Bite": {
		"jp": "かみつく"
	},
	"Sucker Punch": {
		"jp": "ふいうち"
	},
	"Dragon Breath": {
		"jp": "りゅうのいぶき"
	},
	"Thunder Shock": {
		"jp": "でんきショック"
	},
	"Spark": {
		"jp": "スパーク"
	},
	"Low Kick": {
		"jp": "けたぐり"
	},
	"Karate Chop": {
		"jp": "からてチョップ"
	},
	"Ember": {
		"jp": "ひのこ"
	},
	"Wing Attack": {
		"jp": "つばさでうつ"
	},
	"Peck": {
		"jp": "つつく"
	},
	"Lick": {
		"jp": "したでなめる"
	},
	"Shadow Claw": {
		"jp": "シャドークロー"
	},
	"Vine Whip": {
		"jp": "つるのムチ"
	},
	"Razor Leaf": {
		"jp": "はっぱカッター"
	},
	"Mud Shot": {
		"jp": "マッドショット"
	},
	"Ice Shard": {
		"jp": "こおりのつぶて"
	},
	"Frost Breath": {
		"jp": "こおりのいぶき"
	},
	"Quick Attack": {
		"jp": "でんこうせっか"
	},
	"Scratch": {
		"jp": "ひっかく"
	},
	"Tackle": {
		"jp": "たいあたり"
	},
	"Pound": {
		"jp": "はたく"
	},
	"Cut": {
		"jp": "いあいぎり"
	},
	"Poison Jab": {
		"jp": "どくづき"
	},
	"Acid": {
		"jp": "ようかいえき"
	},
	"Psycho Cut": {
		"jp": "サイコカッター"
	},
	"Rock Throw": {
		"jp": "いわおとし"
	},
	"Metal Claw": {
		"jp": "メタルクロー"
	},
	"Bullet Punch": {
		"jp": "バレットパンチ"
	},
	"Water Gun": {
		"jp": "みずでっぽう"
	},
	"Splash": {
		"jp": "はねる"
	},
	"Mud Slap": {
		"jp": "どろかけ"
	},
	"Zen Headbutt": {
		"jp": "しねんのずつき"
	},
	"Confusion": {
		"jp": "ねんりき"
	},
	"Poison Sting": {
		"jp": "どくばり"
	},
	"Bubble": {
		"jp": "あわ"
	},
	"Feint Attack": {
		"jp": "だましうち"
	},
	"Steel Wing": {
		"jp": "はがねのつばさ"
	},
	"Fire Fang": {
		"jp": "ほのおのキバ"
	},
	"Rock Smash": {
		"jp": "いわくだき"
	},
	"Transform": {
		"jp": "へんしん"
	},
	"Counter": {
		"jp": "カウンター"
	},
	"Powder Snow": {
		"jp": "こなゆき"
	},
	"Charge Beam": {
		"jp": "チャージビーム"
	},
	"Volt Switch": {
		"jp": "ボルトチェンジ"
	},
	"Dragon Tail": {
		"jp": "ドラゴンテール"
	},
	"Air Slash": {
		"jp": "エアスラッシュ"
	},
	"Infestation": {
		"jp": "まとわりつく"
	},
	"Struggle Bug": {
		"jp": "むしのていこう"
	},
	"Astonish": {
		"jp": "おどろかす"
	},
	"Hex": {
		"jp": "たたりめ"
	},
	"Iron Tail": {
		"jp": "アイアンテール"
	},
	"Fire Spin": {
		"jp": "ほのおのうず"
	},
	"Bullet Seed": {
		"jp": "タネマシンガン"
	},
	"Extrasensory": {
		"jp": "じんつうりき"
	},
	"Snarl": {
		"jp": "バークアウト"
	},
	"Hidden Power": {
		"jp": "めざめるパワー"
	},
	"Wrap": {
		"jp": "まきつく"
	},
	"Hyper Beam": {
		"jp": "はかいこうせん"
	},
	"Dark Pulse": {
		"jp": "あくのはどう"
	},
	"Sludge": {
		"jp": "ヘドロこうげき"
	},
	"Vice Grip": {
		"jp": "はさむ"
	},
	"Flame Wheel": {
		"jp": "かえんぐるま"
	},
	"Megahorn": {
		"jp": "メガホーン"
	},
	"Flamethrower": {
		"jp": "かえんほうしゃ"
	},
	"Dig": {
		"jp": "あなをほる"
	},
	"Cross Chop": {
		"jp": "クロスチョップ"
	},
	"Psybeam": {
		"jp": "サイケこうせん"
	},
	"Earthquake": {
		"jp": "じしん"
	},
	"Stone Edge": {
		"jp": "ストーンエッジ"
	},
	"Ice Punch": {
		"jp": "れいとうパンチ"
	},
	"Discharge": {
		"jp": "ほうでん"
	},
	"Flash Cannon": {
		"jp": "ラスターカノン"
	},
	"Drill Peck": {
		"jp": "ドリルくちばし"
	},
	"Ice Beam": {
		"jp": "れいとうビーム"
	},
	"Blizzard": {
		"jp": "ふぶき"
	},
	"Heat Wave": {
		"jp": "ねっぷう"
	},
	"Aerial Ace": {
		"jp": "つばめがえし"
	},
	"Drill Run": {
		"jp": "ドリルライナー"
	},
	"Petal Blizzard": {
		"jp": "はなふぶき"
	},
	"Bug Buzz": {
		"jp": "むしのさざめき"
	},
	"Poison Fang": {
		"jp": "どくどくのキバ"
	},
	"Night Slash": {
		"jp": "つじぎり"
	},
	"Bubble Beam": {
		"jp": "バブルこうせん"
	},
	"Submission": {
		"jp": "じごくぐるま"
	},
	"Low Sweep": {
		"jp": "ローキック"
	},
	"Aqua Jet": {
		"jp": "アクアジェット"
	},
	"Aqua Tail": {
		"jp": "アクアテール"
	},
	"Seed Bomb": {
		"jp": "タネばくだん"
	},
	"Psyshock": {
		"jp": "サイコショック"
	},
	"Ancient Power": {
		"jp": "げんしのちから"
	},
	"Rock Tomb": {
		"jp": "がんせきふうじ"
	},
	"Rock Slide": {
		"jp": "いわなだれ"
	},
	"Power Gem": {
		"jp": "パワージェム"
	},
	"Ominous Wind": {
		"jp": "あやしいかぜ"
	},
	"Shadow Ball": {
		"jp": "シャドーボール"
	},
	"Magnet Bomb": {
		"jp": "マグネットボム"
	},
	"Iron Head": {
		"jp": "アイアンヘッド"
	},
	"Thunder Punch": {
		"jp": "かみなりパンチ"
	},
	"Thunder": {
		"jp": "かみなり"
	},
	"Thunderbolt": {
		"jp": "１０まんボルト"
	},
	"Twister": {
		"jp": "たつまき"
	},
	"Dragon Pulse": {
		"jp": "りゅうのはどう"
	},
	"Dragon Claw": {
		"jp": "ドラゴンクロー"
	},
	"Disarming Voice": {
		"jp": "チャームボイス"
	},
	"Draining Kiss": {
		"jp": "ドレインキッス"
	},
	"Dazzling Gleam": {
		"jp": "マジカルシャイン"
	},
	"Moonblast": {
		"jp": "ムーンフォース"
	},
	"Play Rough": {
		"jp": "じゃれつく"
	},
	"Cross Poison": {
		"jp": "クロスポイズン"
	},
	"Sludge Bomb": {
		"jp": "ヘドロばくだん"
	},
	"Sludge Wave": {
		"jp": "ヘドロウェーブ"
	},
	"Gunk Shot": {
		"jp": "ダストシュート"
	},
	"Bone Club": {
		"jp": "ホネこんぼう"
	},
	"Bulldoze": {
		"jp": "じならし"
	},
	"Mud Bomb": {
		"jp": "どろばくだん"
	},
	"Signal Beam": {
		"jp": "シグナルビーム"
	},
	"X-Scissor": {
		"jp": "シザークロス"
	},
	"Flame Charge": {
		"jp": "ニトロチャージ"
	},
	"Flame Burst": {
		"jp": "はじけるほのお"
	},
	"Fire Blast": {
		"jp": "だいもんじ"
	},
	"Brine": {
		"jp": "しおみず"
	},
	"Water Pulse": {
		"jp": "みずのはどう"
	},
	"Scald": {
		"jp": "ねっとう"
	},
	"Hydro Pump": {
		"jp": "ハイドロポンプ"
	},
	"Psychic": {
		"jp": "サイコキネシス"
	},
	"Icy Wind": {
		"jp": "こごえるかぜ"
	},
	"Fire Punch": {
		"jp": "ほのおのパンチ"
	},
	"Solar Beam": {
		"jp": "ソーラービーム"
	},
	"Leaf Blade": {
		"jp": "リーフブレード"
	},
	"Power Whip": {
		"jp": "パワーウィップ"
	},
	"Air Cutter": {
		"jp": "エアカッター"
	},
	"Hurricane": {
		"jp": "ぼうふう"
	},
	"Brick Break": {
		"jp": "かわらわり"
	},
	"Swift": {
		"jp": "スピードスター"
	},
	"Horn Attack": {
		"jp": "つのでつく"
	},
	"Stomp": {
		"jp": "ふみつけ"
	},
	"Hyper Fang": {
		"jp": "ひっさつまえば"
	},
	"Body Slam": {
		"jp": "のしかかり"
	},
	"Close Combat": {
		"jp": "インファイト"
	},
	"Dynamic Punch": {
		"jp": "ばくれつパンチ"
	},
	"Focus Blast": {
		"jp": "きあいだま"
	},
	"Aurora Beam": {
		"jp": "オーロラビーム"
	},
	"Wild Charge": {
		"jp": "ワイルドボルト"
	},
	"Zap Cannon": {
		"jp": "でんじほう"
	},
	"Avalanche": {
		"jp": "ゆきなだれ"
	},
	"Brave Bird": {
		"jp": "ブレイブバード"
	},
	"Sky Attack": {
		"jp": "ゴッドバード"
	},
	"Sand Tomb": {
		"jp": "すなじごく"
	},
	"Rock Blast": {
		"jp": "ロックブラスト"
	},
	"Silver Wind": {
		"jp": "ぎんいろのかぜ"
	},
	"Night Shade": {
		"jp": "ナイトヘッド"
	},
	"Gyro Ball": {
		"jp": "ジャイロボール"
	},
	"Heavy Slam": {
		"jp": "ヘビーボンバー"
	},
	"Overheat": {
		"jp": "オーバーヒート"
	},
	"Grass Knot": {
		"jp": "くさむすび"
	},
	"Energy Ball": {
		"jp": "エナジーボール"
	},
	"Future Sight": {
		"jp": "みらいよち"
	},
	"Mirror Coat": {
		"jp": "ミラーコート"
	},
	"Outrage": {
		"jp": "げきりん"
	},
	"Crunch": {
		"jp": "かみくだく"
	},
	"Foul Play": {
		"jp": "イカサマ"
	},
	"フシギダネ": {},
	"フシギソウ": {},
	"フシギバナ": {},
	"ヒトカゲ": {},
	"リザード": {},
	"リザードン": {},
	"ゼニガメ": {},
	"カメール": {},
	"カメックス": {},
	"キャタピー": {},
	"トランセル": {},
	"バタフリー": {},
	"ビードル": {},
	"コクーン": {},
	"スピアー": {},
	"ポッポ": {},
	"ピジョン": {},
	"ピジョット": {},
	"コラッタ": {},
	"ラッタ": {},
	"オニスズメ": {},
	"オニドリル": {},
	"アーボ": {},
	"アーボック": {},
	"ピチュー": {},
	"ピカチュウ": {},
	"ライチュウ": {},
	"サンド": {},
	"サンドパン": {},
	"ニドラン♀": {},
	"ニドリーナ": {},
	"ニドクイン": {},
	"ニドラン♂": {},
	"ニドリーノ": {},
	"ニドキング": {},
	"ピィ": {},
	"ピッピ": {},
	"ピクシー": {},
	"ロコン": {},
	"キュウコン": {},
	"ププリン": {},
	"プリン": {},
	"プクリン": {},
	"ズバット": {},
	"ゴルバット": {},
	"クロバット": {},
	"ナゾノクサ": {},
	"クサイハナ": {},
	"ラフレシア": {},
	"キレイハナ": {},
	"パラス": {},
	"パラセクト": {},
	"コンパン": {},
	"モルフォン": {},
	"ディグダ": {},
	"ダグトリオ": {},
	"ニャース": {},
	"ペルシアン": {},
	"コダック": {},
	"ゴルダック": {},
	"マンキー": {},
	"オコリザル": {},
	"ガーディ": {},
	"ウインディ": {},
	"ニョロモ": {},
	"ニョロゾ": {},
	"ニョロボン": {},
	"ニョロトノ": {},
	"ケーシィ": {},
	"ユンゲラー": {},
	"フーディン": {},
	"ワンリキー": {},
	"ゴーリキー": {},
	"カイリキー": {},
	"マダツボミ": {},
	"ウツドン": {},
	"ウツボット": {},
	"メノクラゲ": {},
	"ドククラゲ": {},
	"イシツブテ": {},
	"ゴローン": {},
	"ゴローニャ": {},
	"ポニータ": {},
	"ギャロップ": {},
	"ヤドン": {},
	"ヤドラン": {},
	"ヤドキング": {},
	"コイル": {},
	"レアコイル": {},
	"カモネギ": {},
	"ドードー": {},
	"ドードリオ": {},
	"パウワウ": {},
	"ジュゴン": {},
	"ベトベター": {},
	"ベトベトン": {},
	"シェルダー": {},
	"パルシェン": {},
	"ゴース": {},
	"ゴースト": {},
	"ゲンガー": {},
	"イワーク": {},
	"ハガネール": {},
	"スリープ": {},
	"スリーパー": {},
	"クラブ": {},
	"キングラー": {},
	"ビリリダマ": {},
	"マルマイン": {},
	"タマタマ": {},
	"ナッシー": {},
	"カラカラ": {},
	"ガラガラ": {},
	"バルキー": {},
	"サワムラー": {},
	"エビワラー": {},
	"カポエラー": {},
	"ベロリンガ": {},
	"ドガース": {},
	"マタドガス": {},
	"サイホーン": {},
	"サイドン": {},
	"ラッキー": {},
	"ハピナス": {},
	"モンジャラ": {},
	"ガルーラ": {},
	"タッツー": {},
	"シードラ": {},
	"キングドラ": {},
	"トサキント": {},
	"アズマオウ": {},
	"ヒトデマン": {},
	"スターミー": {},
	"バリヤード": {},
	"ストライク": {},
	"ハッサム": {},
	"ムチュール": {},
	"ルージュラ": {},
	"エレキッド": {},
	"エレブー": {},
	"ブビィ": {},
	"ブーバー": {},
	"カイロス": {},
	"ケンタロス": {},
	"コイキング": {},
	"ギャラドス": {},
	"ラプラス": {},
	"メタモン": {},
	"イーブイ": {},
	"シャワーズ": {},
	"サンダース": {},
	"ブースター": {},
	"エーフィ": {},
	"ブラッキー": {},
	"ポリゴン": {},
	"ポリゴン２": {},
	"オムナイト": {},
	"オムスター": {},
	"カブト": {},
	"カブトプス": {},
	"プテラ": {},
	"カビゴン": {},
	"フリーザー": {},
	"サンダー": {},
	"ファイヤー": {},
	"ミニリュウ": {},
	"ハクリュー": {},
	"カイリュー": {},
	"ミュウツー": {},
	"ミュウ": {},
	"チコリータ": {},
	"ベイリーフ": {},
	"メガニウム": {},
	"ヒノアラシ": {},
	"マグマラシ": {},
	"バクフーン": {},
	"ワニノコ": {},
	"アリゲイツ": {},
	"オーダイル": {},
	"オタチ": {},
	"オオタチ": {},
	"ホーホー": {},
	"ヨルノズク": {},
	"レディバ": {},
	"レディアン": {},
	"イトマル": {},
	"アリアドス": {},
	"チョンチー": {},
	"ランターン": {},
	"トゲピー": {},
	"トゲチック": {},
	"ネイティ": {},
	"ネイティオ": {},
	"メリープ": {},
	"モココ": {},
	"デンリュウ": {},
	"マリル": {},
	"マリルリ": {},
	"ウソッキー": {},
	"ハネッコ": {},
	"ポポッコ": {},
	"ワタッコ": {},
	"エイパム": {},
	"ヒマナッツ": {},
	"キマワリ": {},
	"ヤンヤンマ": {},
	"ウパー": {},
	"ヌオー": {},
	"ヤミカラス": {},
	"ムウマ": {},
	"アンノーン": {},
	"ソーナンス": {},
	"キリンリキ": {},
	"クヌギダマ": {},
	"フォレトス": {},
	"ノコッチ": {},
	"グライガー": {},
	"ブルー": {},
	"グランブル": {},
	"ハリーセン": {},
	"ツボツボ": {},
	"ヘラクロス": {},
	"ニューラ": {},
	"ヒメグマ": {},
	"リングマ": {},
	"マグマッグ": {},
	"マグカルゴ": {},
	"ウリムー": {},
	"イノムー": {},
	"サニーゴ": {},
	"テッポウオ": {},
	"オクタン": {},
	"デリバード": {},
	"マンタイン": {},
	"エアームド": {},
	"デルビル": {},
	"ヘルガー": {},
	"ゴマゾウ": {},
	"ドンファン": {},
	"オドシシ": {},
	"ドーブル": {},
	"ミルタンク": {},
	"ライコウ": {},
	"エンテイ": {},
	"スイクン": {},
	"ヨーギラス": {},
	"サナギラス": {},
	"バンギラス": {},
	"ルギア": {},
	"ホウオウ": {},
	"セレビィ": {},
	"わるあがき": {},
	"れんぞくぎり": {},
	"むしくい": {},
	"かみつく": {},
	"ふいうち": {},
	"りゅうのいぶき": {},
	"でんきショック": {},
	"スパーク": {},
	"けたぐり": {},
	"からてチョップ": {},
	"ひのこ": {},
	"つばさでうつ": {},
	"つつく": {},
	"したでなめる": {},
	"シャドークロー": {},
	"つるのムチ": {},
	"はっぱカッター": {},
	"マッドショット": {},
	"こおりのつぶて": {},
	"こおりのいぶき": {},
	"でんこうせっか": {},
	"ひっかく": {},
	"たいあたり": {},
	"はたく": {},
	"いあいぎり": {},
	"どくづき": {},
	"ようかいえき": {},
	"サイコカッター": {},
	"いわおとし": {},
	"メタルクロー": {},
	"バレットパンチ": {},
	"みずでっぽう": {},
	"はねる": {},
	"どろかけ": {},
	"しねんのずつき": {},
	"ねんりき": {},
	"どくばり": {},
	"あわ": {},
	"だましうち": {},
	"はがねのつばさ": {},
	"ほのおのキバ": {},
	"いわくだき": {},
	"へんしん": {},
	"カウンター": {},
	"こなゆき": {},
	"チャージビーム": {},
	"ボルトチェンジ": {},
	"ドラゴンテール": {},
	"エアスラッシュ": {},
	"まとわりつく": {},
	"むしのていこう": {},
	"おどろかす": {},
	"たたりめ": {},
	"アイアンテール": {},
	"ほのおのうず": {},
	"タネマシンガン": {},
	"じんつうりき": {},
	"バークアウト": {},
	"めざめるパワー": {},
	"まきつく": {},
	"はかいこうせん": {},
	"あくのはどう": {},
	"ヘドロこうげき": {},
	"はさむ": {},
	"かえんぐるま": {},
	"メガホーン": {},
	"かえんほうしゃ": {},
	"あなをほる": {},
	"クロスチョップ": {},
	"サイケこうせん": {},
	"じしん": {},
	"ストーンエッジ": {},
	"れいとうパンチ": {},
	"ほうでん": {},
	"ラスターカノン": {},
	"ドリルくちばし": {},
	"れいとうビーム": {},
	"ふぶき": {},
	"ねっぷう": {},
	"つばめがえし": {},
	"ドリルライナー": {},
	"はなふぶき": {},
	"むしのさざめき": {},
	"どくどくのキバ": {},
	"つじぎり": {},
	"バブルこうせん": {},
	"じごくぐるま": {},
	"ローキック": {},
	"アクアジェット": {},
	"アクアテール": {},
	"タネばくだん": {},
	"サイコショック": {},
	"げんしのちから": {},
	"がんせきふうじ": {},
	"いわなだれ": {},
	"パワージェム": {},
	"あやしいかぜ": {},
	"シャドーボール": {},
	"マグネットボム": {},
	"アイアンヘッド": {},
	"かみなりパンチ": {},
	"かみなり": {},
	"１０まんボルト": {},
	"たつまき": {},
	"りゅうのはどう": {},
	"ドラゴンクロー": {},
	"チャームボイス": {},
	"ドレインキッス": {},
	"マジカルシャイン": {},
	"ムーンフォース": {},
	"じゃれつく": {},
	"クロスポイズン": {},
	"ヘドロばくだん": {},
	"ヘドロウェーブ": {},
	"ダストシュート": {},
	"ホネこんぼう": {},
	"じならし": {},
	"どろばくだん": {},
	"シグナルビーム": {},
	"シザークロス": {},
	"ニトロチャージ": {},
	"はじけるほのお": {},
	"だいもんじ": {},
	"しおみず": {},
	"みずのはどう": {},
	"ねっとう": {},
	"ハイドロポンプ": {},
	"サイコキネシス": {},
	"こごえるかぜ": {},
	"ほのおのパンチ": {},
	"ソーラービーム": {},
	"リーフブレード": {},
	"パワーウィップ": {},
	"エアカッター": {},
	"ぼうふう": {},
	"かわらわり": {},
	"スピードスター": {},
	"つのでつく": {},
	"ふみつけ": {},
	"ひっさつまえば": {},
	"のしかかり": {},
	"インファイト": {},
	"ばくれつパンチ": {},
	"きあいだま": {},
	"オーロラビーム": {},
	"ワイルドボルト": {},
	"でんじほう": {},
	"ゆきなだれ": {},
	"ブレイブバード": {},
	"ゴッドバード": {},
	"すなじごく": {},
	"ロックブラスト": {},
	"ぎんいろのかぜ": {},
	"ナイトヘッド": {},
	"ジャイロボール": {},
	"ヘビーボンバー": {},
	"オーバーヒート": {},
	"くさむすび": {},
	"エナジーボール": {},
	"みらいよち": {},
	"ミラーコート": {},
	"げきりん": {},
	"かみくだく": {},
	"イカサマ": {}
}"
var name_maps = {};
var gap = name_list.length/2;
for(var i = 0 ; i <= gap-1 ; i++){
	var name_map = {};
	name_map["jp"] = name_list[i+gap];
	name_maps[name_list[i]] = name_map
}
Object {jp: "イカサマ"}
JSON.stringify(name_maps,null,'\t')
"{
	"Bulbasaur": {
		"jp": "フシギダネ"
	},
	"Ivysaur": {
		"jp": "フシギソウ"
	},
	"Venusaur": {
		"jp": "フシギバナ"
	},
	"Charmander": {
		"jp": "ヒトカゲ"
	},
	"Charmeleon": {
		"jp": "リザード"
	},
	"Charizard": {
		"jp": "リザードン"
	},
	"Squirtle": {
		"jp": "ゼニガメ"
	},
	"Wartortle": {
		"jp": "カメール"
	},
	"Blastoise": {
		"jp": "カメックス"
	},
	"Caterpie": {
		"jp": "キャタピー"
	},
	"Metapod": {
		"jp": "トランセル"
	},
	"Butterfree": {
		"jp": "バタフリー"
	},
	"Weedle": {
		"jp": "ビードル"
	},
	"Kakuna": {
		"jp": "コクーン"
	},
	"Beedrill": {
		"jp": "スピアー"
	},
	"Pidgey": {
		"jp": "ポッポ"
	},
	"Pidgeotto": {
		"jp": "ピジョン"
	},
	"Pidgeot": {
		"jp": "ピジョット"
	},
	"Rattata": {
		"jp": "コラッタ"
	},
	"Raticate": {
		"jp": "ラッタ"
	},
	"Spearow": {
		"jp": "オニスズメ"
	},
	"Fearow": {
		"jp": "オニドリル"
	},
	"Ekans": {
		"jp": "アーボ"
	},
	"Arbok": {
		"jp": "アーボック"
	},
	"Pichu": {
		"jp": "ピチュー"
	},
	"Pikachu": {
		"jp": "ピカチュウ"
	},
	"Raichu": {
		"jp": "ライチュウ"
	},
	"Sandshrew": {
		"jp": "サンド"
	},
	"Sandslash": {
		"jp": "サンドパン"
	},
	"Nidoran♀": {
		"jp": "ニドラン♀"
	},
	"Nidorina": {
		"jp": "ニドリーナ"
	},
	"Nidoqueen": {
		"jp": "ニドクイン"
	},
	"Nidoran♂": {
		"jp": "ニドラン♂"
	},
	"Nidorino": {
		"jp": "ニドリーノ"
	},
	"Nidoking": {
		"jp": "ニドキング"
	},
	"Cleffa": {
		"jp": "ピィ"
	},
	"Clefairy": {
		"jp": "ピッピ"
	},
	"Clefable": {
		"jp": "ピクシー"
	},
	"Vulpix": {
		"jp": "ロコン"
	},
	"Ninetales": {
		"jp": "キュウコン"
	},
	"Igglybuff": {
		"jp": "ププリン"
	},
	"Jigglypuff": {
		"jp": "プリン"
	},
	"Wigglytuff": {
		"jp": "プクリン"
	},
	"Zubat": {
		"jp": "ズバット"
	},
	"Golbat": {
		"jp": "ゴルバット"
	},
	"Crobat": {
		"jp": "クロバット"
	},
	"Oddish": {
		"jp": "ナゾノクサ"
	},
	"Gloom": {
		"jp": "クサイハナ"
	},
	"Vileplume": {
		"jp": "ラフレシア"
	},
	"Bellossom": {
		"jp": "キレイハナ"
	},
	"Paras": {
		"jp": "パラス"
	},
	"Parasect": {
		"jp": "パラセクト"
	},
	"Venonat": {
		"jp": "コンパン"
	},
	"Venomoth": {
		"jp": "モルフォン"
	},
	"Diglett": {
		"jp": "ディグダ"
	},
	"Dugtrio": {
		"jp": "ダグトリオ"
	},
	"Meowth": {
		"jp": "ニャース"
	},
	"Persian": {
		"jp": "ペルシアン"
	},
	"Psyduck": {
		"jp": "コダック"
	},
	"Golduck": {
		"jp": "ゴルダック"
	},
	"Mankey": {
		"jp": "マンキー"
	},
	"Primeape": {
		"jp": "オコリザル"
	},
	"Growlithe": {
		"jp": "ガーディ"
	},
	"Arcanine": {
		"jp": "ウインディ"
	},
	"Poliwag": {
		"jp": "ニョロモ"
	},
	"Poliwhirl": {
		"jp": "ニョロゾ"
	},
	"Poliwrath": {
		"jp": "ニョロボン"
	},
	"Politoed": {
		"jp": "ニョロトノ"
	},
	"Abra": {
		"jp": "ケーシィ"
	},
	"Kadabra": {
		"jp": "ユンゲラー"
	},
	"Alakazam": {
		"jp": "フーディン"
	},
	"Machop": {
		"jp": "ワンリキー"
	},
	"Machoke": {
		"jp": "ゴーリキー"
	},
	"Machamp": {
		"jp": "カイリキー"
	},
	"Bellsprout": {
		"jp": "マダツボミ"
	},
	"Weepinbell": {
		"jp": "ウツドン"
	},
	"Victreebel": {
		"jp": "ウツボット"
	},
	"Tentacool": {
		"jp": "メノクラゲ"
	},
	"Tentacruel": {
		"jp": "ドククラゲ"
	},
	"Geodude": {
		"jp": "イシツブテ"
	},
	"Graveler": {
		"jp": "ゴローン"
	},
	"Golem": {
		"jp": "ゴローニャ"
	},
	"Ponyta": {
		"jp": "ポニータ"
	},
	"Rapidash": {
		"jp": "ギャロップ"
	},
	"Slowpoke": {
		"jp": "ヤドン"
	},
	"Slowbro": {
		"jp": "ヤドラン"
	},
	"Slowking": {
		"jp": "ヤドキング"
	},
	"Magnemite": {
		"jp": "コイル"
	},
	"Magneton": {
		"jp": "レアコイル"
	},
	"Farfetch'd": {
		"jp": "カモネギ"
	},
	"Doduo": {
		"jp": "ドードー"
	},
	"Dodrio": {
		"jp": "ドードリオ"
	},
	"Seel": {
		"jp": "パウワウ"
	},
	"Dewgong": {
		"jp": "ジュゴン"
	},
	"Grimer": {
		"jp": "ベトベター"
	},
	"Muk": {
		"jp": "ベトベトン"
	},
	"Shellder": {
		"jp": "シェルダー"
	},
	"Cloyster": {
		"jp": "パルシェン"
	},
	"Gastly": {
		"jp": "ゴース"
	},
	"Haunter": {
		"jp": "ゴースト"
	},
	"Gengar": {
		"jp": "ゲンガー"
	},
	"Onix": {
		"jp": "イワーク"
	},
	"Steelix": {
		"jp": "ハガネール"
	},
	"Drowzee": {
		"jp": "スリープ"
	},
	"Hypno": {
		"jp": "スリーパー"
	},
	"Krabby": {
		"jp": "クラブ"
	},
	"Kingler": {
		"jp": "キングラー"
	},
	"Voltorb": {
		"jp": "ビリリダマ"
	},
	"Electrode": {
		"jp": "マルマイン"
	},
	"Exeggcute": {
		"jp": "タマタマ"
	},
	"Exeggutor": {
		"jp": "ナッシー"
	},
	"Cubone": {
		"jp": "カラカラ"
	},
	"Marowak": {
		"jp": "ガラガラ"
	},
	"Tyrogue": {
		"jp": "バルキー"
	},
	"Hitmonlee": {
		"jp": "サワムラー"
	},
	"Hitmonchan": {
		"jp": "エビワラー"
	},
	"Hitmontop": {
		"jp": "カポエラー"
	},
	"Lickitung": {
		"jp": "ベロリンガ"
	},
	"Koffing": {
		"jp": "ドガース"
	},
	"Weezing": {
		"jp": "マタドガス"
	},
	"Rhyhorn": {
		"jp": "サイホーン"
	},
	"Rhydon": {
		"jp": "サイドン"
	},
	"Chansey": {
		"jp": "ラッキー"
	},
	"Blissey": {
		"jp": "ハピナス"
	},
	"Tangela": {
		"jp": "モンジャラ"
	},
	"Kangaskhan": {
		"jp": "ガルーラ"
	},
	"Horsea": {
		"jp": "タッツー"
	},
	"Seadra": {
		"jp": "シードラ"
	},
	"Kingdra": {
		"jp": "キングドラ"
	},
	"Goldeen": {
		"jp": "トサキント"
	},
	"Seaking": {
		"jp": "アズマオウ"
	},
	"Staryu": {
		"jp": "ヒトデマン"
	},
	"Starmie": {
		"jp": "スターミー"
	},
	"Mr. Mime": {
		"jp": "バリヤード"
	},
	"Scyther": {
		"jp": "ストライク"
	},
	"Scizor": {
		"jp": "ハッサム"
	},
	"Smoochum": {
		"jp": "ムチュール"
	},
	"Jynx": {
		"jp": "ルージュラ"
	},
	"Elekid": {
		"jp": "エレキッド"
	},
	"Electabuzz": {
		"jp": "エレブー"
	},
	"Magby": {
		"jp": "ブビィ"
	},
	"Magmar": {
		"jp": "ブーバー"
	},
	"Pinsir": {
		"jp": "カイロス"
	},
	"Tauros": {
		"jp": "ケンタロス"
	},
	"Magikarp": {
		"jp": "コイキング"
	},
	"Gyarados": {
		"jp": "ギャラドス"
	},
	"Lapras": {
		"jp": "ラプラス"
	},
	"Ditto": {
		"jp": "メタモン"
	},
	"Eevee": {
		"jp": "イーブイ"
	},
	"Vaporeon": {
		"jp": "シャワーズ"
	},
	"Jolteon": {
		"jp": "サンダース"
	},
	"Flareon": {
		"jp": "ブースター"
	},
	"Espeon": {
		"jp": "エーフィ"
	},
	"Umbreon": {
		"jp": "ブラッキー"
	},
	"Porygon": {
		"jp": "ポリゴン"
	},
	"Porygon2": {
		"jp": "ポリゴン２"
	},
	"Omanyte": {
		"jp": "オムナイト"
	},
	"Omastar": {
		"jp": "オムスター"
	},
	"Kabuto": {
		"jp": "カブト"
	},
	"Kabutops": {
		"jp": "カブトプス"
	},
	"Aerodactyl": {
		"jp": "プテラ"
	},
	"Snorlax": {
		"jp": "カビゴン"
	},
	"Articuno": {
		"jp": "フリーザー"
	},
	"Zapdos": {
		"jp": "サンダー"
	},
	"Moltres": {
		"jp": "ファイヤー"
	},
	"Dratini": {
		"jp": "ミニリュウ"
	},
	"Dragonair": {
		"jp": "ハクリュー"
	},
	"Dragonite": {
		"jp": "カイリュー"
	},
	"Mewtwo": {
		"jp": "ミュウツー"
	},
	"Mew": {
		"jp": "ミュウ"
	},
	"Chikorita": {
		"jp": "チコリータ"
	},
	"Bayleef": {
		"jp": "ベイリーフ"
	},
	"Meganium": {
		"jp": "メガニウム"
	},
	"Cyndaquil": {
		"jp": "ヒノアラシ"
	},
	"Quilava": {
		"jp": "マグマラシ"
	},
	"Typhlosion": {
		"jp": "バクフーン"
	},
	"Totodile": {
		"jp": "ワニノコ"
	},
	"Croconaw": {
		"jp": "アリゲイツ"
	},
	"Feraligatr": {
		"jp": "オーダイル"
	},
	"Sentret": {
		"jp": "オタチ"
	},
	"Furret": {
		"jp": "オオタチ"
	},
	"Hoothoot": {
		"jp": "ホーホー"
	},
	"Noctowl": {
		"jp": "ヨルノズク"
	},
	"Ledyba": {
		"jp": "レディバ"
	},
	"Ledian": {
		"jp": "レディアン"
	},
	"Spinarak": {
		"jp": "イトマル"
	},
	"Ariados": {
		"jp": "アリアドス"
	},
	"Chinchou": {
		"jp": "チョンチー"
	},
	"Lanturn": {
		"jp": "ランターン"
	},
	"Togepi": {
		"jp": "トゲピー"
	},
	"Togetic": {
		"jp": "トゲチック"
	},
	"Natu": {
		"jp": "ネイティ"
	},
	"Xatu": {
		"jp": "ネイティオ"
	},
	"Mareep": {
		"jp": "メリープ"
	},
	"Flaaffy": {
		"jp": "モココ"
	},
	"Ampharos": {
		"jp": "デンリュウ"
	},
	"Marill": {
		"jp": "マリル"
	},
	"Azumarill": {
		"jp": "マリルリ"
	},
	"Sudowoodo": {
		"jp": "ウソッキー"
	},
	"Hoppip": {
		"jp": "ハネッコ"
	},
	"Skiploom": {
		"jp": "ポポッコ"
	},
	"Jumpluff": {
		"jp": "ワタッコ"
	},
	"Aipom": {
		"jp": "エイパム"
	},
	"Sunkern": {
		"jp": "ヒマナッツ"
	},
	"Sunflora": {
		"jp": "キマワリ"
	},
	"Yanma": {
		"jp": "ヤンヤンマ"
	},
	"Wooper": {
		"jp": "ウパー"
	},
	"Quagsire": {
		"jp": "ヌオー"
	},
	"Murkrow": {
		"jp": "ヤミカラス"
	},
	"Misdreavus": {
		"jp": "ムウマ"
	},
	"Unown": {
		"jp": "アンノーン"
	},
	"Wobbuffet": {
		"jp": "ソーナンス"
	},
	"Girafarig": {
		"jp": "キリンリキ"
	},
	"Pineco": {
		"jp": "クヌギダマ"
	},
	"Forretress": {
		"jp": "フォレトス"
	},
	"Dunsparce": {
		"jp": "ノコッチ"
	},
	"Gligar": {
		"jp": "グライガー"
	},
	"Snubbull": {
		"jp": "ブルー"
	},
	"Granbull": {
		"jp": "グランブル"
	},
	"Qwilfish": {
		"jp": "ハリーセン"
	},
	"Shuckle": {
		"jp": "ツボツボ"
	},
	"Heracross": {
		"jp": "ヘラクロス"
	},
	"Sneasel": {
		"jp": "ニューラ"
	},
	"Teddiursa": {
		"jp": "ヒメグマ"
	},
	"Ursaring": {
		"jp": "リングマ"
	},
	"Slugma": {
		"jp": "マグマッグ"
	},
	"Magcargo": {
		"jp": "マグカルゴ"
	},
	"Swinub": {
		"jp": "ウリムー"
	},
	"Piloswine": {
		"jp": "イノムー"
	},
	"Corsola": {
		"jp": "サニーゴ"
	},
	"Remoraid": {
		"jp": "テッポウオ"
	},
	"Octillery": {
		"jp": "オクタン"
	},
	"Delibird": {
		"jp": "デリバード"
	},
	"Mantine": {
		"jp": "マンタイン"
	},
	"Skarmory": {
		"jp": "エアームド"
	},
	"Houndour": {
		"jp": "デルビル"
	},
	"Houndoom": {
		"jp": "ヘルガー"
	},
	"Phanpy": {
		"jp": "ゴマゾウ"
	},
	"Donphan": {
		"jp": "ドンファン"
	},
	"Stantler": {
		"jp": "オドシシ"
	},
	"Smeargle": {
		"jp": "ドーブル"
	},
	"Miltank": {
		"jp": "ミルタンク"
	},
	"Raikou": {
		"jp": "ライコウ"
	},
	"Entei": {
		"jp": "エンテイ"
	},
	"Suicune": {
		"jp": "スイクン"
	},
	"Larvitar": {
		"jp": "ヨーギラス"
	},
	"Pupitar": {
		"jp": "サナギラス"
	},
	"Tyranitar": {
		"jp": "バンギラス"
	},
	"Lugia": {
		"jp": "ルギア"
	},
	"Ho-Oh": {
		"jp": "ホウオウ"
	},
	"Celebi": {
		"jp": "セレビィ"
	},
	"Struggle": {
		"jp": "わるあがき"
	},
	"Fury Cutter": {
		"jp": "れんぞくぎり"
	},
	"Bug Bite": {
		"jp": "むしくい"
	},
	"Bite": {
		"jp": "かみつく"
	},
	"Sucker Punch": {
		"jp": "ふいうち"
	},
	"Dragon Breath": {
		"jp": "りゅうのいぶき"
	},
	"Thunder Shock": {
		"jp": "でんきショック"
	},
	"Spark": {
		"jp": "スパーク"
	},
	"Low Kick": {
		"jp": "けたぐり"
	},
	"Karate Chop": {
		"jp": "からてチョップ"
	},
	"Ember": {
		"jp": "ひのこ"
	},
	"Wing Attack": {
		"jp": "つばさでうつ"
	},
	"Peck": {
		"jp": "つつく"
	},
	"Lick": {
		"jp": "したでなめる"
	},
	"Shadow Claw": {
		"jp": "シャドークロー"
	},
	"Vine Whip": {
		"jp": "つるのムチ"
	},
	"Razor Leaf": {
		"jp": "はっぱカッター"
	},
	"Mud Shot": {
		"jp": "マッドショット"
	},
	"Ice Shard": {
		"jp": "こおりのつぶて"
	},
	"Frost Breath": {
		"jp": "こおりのいぶき"
	},
	"Quick Attack": {
		"jp": "でんこうせっか"
	},
	"Scratch": {
		"jp": "ひっかく"
	},
	"Tackle": {
		"jp": "たいあたり"
	},
	"Pound": {
		"jp": "はたく"
	},
	"Cut": {
		"jp": "いあいぎり"
	},
	"Poison Jab": {
		"jp": "どくづき"
	},
	"Acid": {
		"jp": "ようかいえき"
	},
	"Psycho Cut": {
		"jp": "サイコカッター"
	},
	"Rock Throw": {
		"jp": "いわおとし"
	},
	"Metal Claw": {
		"jp": "メタルクロー"
	},
	"Bullet Punch": {
		"jp": "バレットパンチ"
	},
	"Water Gun": {
		"jp": "みずでっぽう"
	},
	"Splash": {
		"jp": "はねる"
	},
	"Mud Slap": {
		"jp": "どろかけ"
	},
	"Zen Headbutt": {
		"jp": "しねんのずつき"
	},
	"Confusion": {
		"jp": "ねんりき"
	},
	"Poison Sting": {
		"jp": "どくばり"
	},
	"Bubble": {
		"jp": "あわ"
	},
	"Feint Attack": {
		"jp": "だましうち"
	},
	"Steel Wing": {
		"jp": "はがねのつばさ"
	},
	"Fire Fang": {
		"jp": "ほのおのキバ"
	},
	"Rock Smash": {
		"jp": "いわくだき"
	},
	"Transform": {
		"jp": "へんしん"
	},
	"Counter": {
		"jp": "カウンター"
	},
	"Powder Snow": {
		"jp": "こなゆき"
	},
	"Charge Beam": {
		"jp": "チャージビーム"
	},
	"Volt Switch": {
		"jp": "ボルトチェンジ"
	},
	"Dragon Tail": {
		"jp": "ドラゴンテール"
	},
	"Air Slash": {
		"jp": "エアスラッシュ"
	},
	"Infestation": {
		"jp": "まとわりつく"
	},
	"Struggle Bug": {
		"jp": "むしのていこう"
	},
	"Astonish": {
		"jp": "おどろかす"
	},
	"Hex": {
		"jp": "たたりめ"
	},
	"Iron Tail": {
		"jp": "アイアンテール"
	},
	"Fire Spin": {
		"jp": "ほのおのうず"
	},
	"Bullet Seed": {
		"jp": "タネマシンガン"
	},
	"Extrasensory": {
		"jp": "じんつうりき"
	},
	"Snarl": {
		"jp": "バークアウト"
	},
	"Hidden Power": {
		"jp": "めざめるパワー"
	},
	"Wrap": {
		"jp": "まきつく"
	},
	"Hyper Beam": {
		"jp": "はかいこうせん"
	},
	"Dark Pulse": {
		"jp": "あくのはどう"
	},
	"Sludge": {
		"jp": "ヘドロこうげき"
	},
	"Vice Grip": {
		"jp": "はさむ"
	},
	"Flame Wheel": {
		"jp": "かえんぐるま"
	},
	"Megahorn": {
		"jp": "メガホーン"
	},
	"Flamethrower": {
		"jp": "かえんほうしゃ"
	},
	"Dig": {
		"jp": "あなをほる"
	},
	"Cross Chop": {
		"jp": "クロスチョップ"
	},
	"Psybeam": {
		"jp": "サイケこうせん"
	},
	"Earthquake": {
		"jp": "じしん"
	},
	"Stone Edge": {
		"jp": "ストーンエッジ"
	},
	"Ice Punch": {
		"jp": "れいとうパンチ"
	},
	"Discharge": {
		"jp": "ほうでん"
	},
	"Flash Cannon": {
		"jp": "ラスターカノン"
	},
	"Drill Peck": {
		"jp": "ドリルくちばし"
	},
	"Ice Beam": {
		"jp": "れいとうビーム"
	},
	"Blizzard": {
		"jp": "ふぶき"
	},
	"Heat Wave": {
		"jp": "ねっぷう"
	},
	"Aerial Ace": {
		"jp": "つばめがえし"
	},
	"Drill Run": {
		"jp": "ドリルライナー"
	},
	"Petal Blizzard": {
		"jp": "はなふぶき"
	},
	"Bug Buzz": {
		"jp": "むしのさざめき"
	},
	"Poison Fang": {
		"jp": "どくどくのキバ"
	},
	"Night Slash": {
		"jp": "つじぎり"
	},
	"Bubble Beam": {
		"jp": "バブルこうせん"
	},
	"Submission": {
		"jp": "じごくぐるま"
	},
	"Low Sweep": {
		"jp": "ローキック"
	},
	"Aqua Jet": {
		"jp": "アクアジェット"
	},
	"Aqua Tail": {
		"jp": "アクアテール"
	},
	"Seed Bomb": {
		"jp": "タネばくだん"
	},
	"Psyshock": {
		"jp": "サイコショック"
	},
	"Ancient Power": {
		"jp": "げんしのちから"
	},
	"Rock Tomb": {
		"jp": "がんせきふうじ"
	},
	"Rock Slide": {
		"jp": "いわなだれ"
	},
	"Power Gem": {
		"jp": "パワージェム"
	},
	"Ominous Wind": {
		"jp": "あやしいかぜ"
	},
	"Shadow Ball": {
		"jp": "シャドーボール"
	},
	"Magnet Bomb": {
		"jp": "マグネットボム"
	},
	"Iron Head": {
		"jp": "アイアンヘッド"
	},
	"Thunder Punch": {
		"jp": "かみなりパンチ"
	},
	"Thunder": {
		"jp": "かみなり"
	},
	"Thunderbolt": {
		"jp": "１０まんボルト"
	},
	"Twister": {
		"jp": "たつまき"
	},
	"Dragon Pulse": {
		"jp": "りゅうのはどう"
	},
	"Dragon Claw": {
		"jp": "ドラゴンクロー"
	},
	"Disarming Voice": {
		"jp": "チャームボイス"
	},
	"Draining Kiss": {
		"jp": "ドレインキッス"
	},
	"Dazzling Gleam": {
		"jp": "マジカルシャイン"
	},
	"Moonblast": {
		"jp": "ムーンフォース"
	},
	"Play Rough": {
		"jp": "じゃれつく"
	},
	"Cross Poison": {
		"jp": "クロスポイズン"
	},
	"Sludge Bomb": {
		"jp": "ヘドロばくだん"
	},
	"Sludge Wave": {
		"jp": "ヘドロウェーブ"
	},
	"Gunk Shot": {
		"jp": "ダストシュート"
	},
	"Bone Club": {
		"jp": "ホネこんぼう"
	},
	"Bulldoze": {
		"jp": "じならし"
	},
	"Mud Bomb": {
		"jp": "どろばくだん"
	},
	"Signal Beam": {
		"jp": "シグナルビーム"
	},
	"X-Scissor": {
		"jp": "シザークロス"
	},
	"Flame Charge": {
		"jp": "ニトロチャージ"
	},
	"Flame Burst": {
		"jp": "はじけるほのお"
	},
	"Fire Blast": {
		"jp": "だいもんじ"
	},
	"Brine": {
		"jp": "しおみず"
	},
	"Water Pulse": {
		"jp": "みずのはどう"
	},
	"Scald": {
		"jp": "ねっとう"
	},
	"Hydro Pump": {
		"jp": "ハイドロポンプ"
	},
	"Psychic": {
		"jp": "サイコキネシス"
	},
	"Icy Wind": {
		"jp": "こごえるかぜ"
	},
	"Fire Punch": {
		"jp": "ほのおのパンチ"
	},
	"Solar Beam": {
		"jp": "ソーラービーム"
	},
	"Leaf Blade": {
		"jp": "リーフブレード"
	},
	"Power Whip": {
		"jp": "パワーウィップ"
	},
	"Air Cutter": {
		"jp": "エアカッター"
	},
	"Hurricane": {
		"jp": "ぼうふう"
	},
	"Brick Break": {
		"jp": "かわらわり"
	},
	"Swift": {
		"jp": "スピードスター"
	},
	"Horn Attack": {
		"jp": "つのでつく"
	},
	"Stomp": {
		"jp": "ふみつけ"
	},
	"Hyper Fang": {
		"jp": "ひっさつまえば"
	},
	"Body Slam": {
		"jp": "のしかかり"
	},
	"Close Combat": {
		"jp": "インファイト"
	},
	"Dynamic Punch": {
		"jp": "ばくれつパンチ"
	},
	"Focus Blast": {
		"jp": "きあいだま"
	},
	"Aurora Beam": {
		"jp": "オーロラビーム"
	},
	"Wild Charge": {
		"jp": "ワイルドボルト"
	},
	"Zap Cannon": {
		"jp": "でんじほう"
	},
	"Avalanche": {
		"jp": "ゆきなだれ"
	},
	"Brave Bird": {
		"jp": "ブレイブバード"
	},
	"Sky Attack": {
		"jp": "ゴッドバード"
	},
	"Sand Tomb": {
		"jp": "すなじごく"
	},
	"Rock Blast": {
		"jp": "ロックブラスト"
	},
	"Silver Wind": {
		"jp": "ぎんいろのかぜ"
	},
	"Night Shade": {
		"jp": "ナイトヘッド"
	},
	"Gyro Ball": {
		"jp": "ジャイロボール"
	},
	"Heavy Slam": {
		"jp": "ヘビーボンバー"
	},
	"Overheat": {
		"jp": "オーバーヒート"
	},
	"Grass Knot": {
		"jp": "くさむすび"
	},
	"Energy Ball": {
		"jp": "エナジーボール"
	},
	"Future Sight": {
		"jp": "みらいよち"
	},
	"Mirror Coat": {
		"jp": "ミラーコート"
	},
	"Outrage": {
		"jp": "げきりん"
	},
	"Crunch": {
		"jp": "かみくだく"
	},
	"Foul Play": {
		"jp": "イカサマ"
	}
}